import '../App.css';
import Auth from '../components/auth/index';
import MainContainer from '../components/container';
import single_course from '../images/singlecourse.png'
import "slick-carousel/slick/slick.css";
import "slick-carousel/slick/slick-theme.css";
import Footer from '../components/footer';
import germany from '../icons/emojione_flag-for-germany.svg'
import like from '../icons/like.svg'
import ph_arrow from '../icons/ph_arrow-up-duotone.svg'
import Button from '../components/button';
import Social from '../components/social';
import person1 from '../images/person1.png'


function Ausbildung() {
  return (
    <div className="bg-gray-50">
      <Auth />
      <div className='w-full flex flex-col items-center text-center'>
        <div className='w-full bg-gray-50 flex-col justify-center py-14 pb-0 relative'>
          <div className='absolute bg-gray-200 top-0 right-0 left-0 h-96 '></div>
          <MainContainer className='inline-flex flex-col justify-center items-center z-10 relative'>
            <div className='w-full flex justify-between'>
              <div className='inline-flex flex-col rounded-md overflow-hidden text-right gap-5'>
                <div className='text-3xl font-bold'>آوسبیلدونگ طراح رابط کاربری</div>
                <div className='text-sm text-gray-600'>لیست مشاغل - رشته های هنری - طراح رابط کاربری</div>
              </div>
              <div className='inline-flex gap-1 items-center'>
                <p className='text-primary-default font-bold text-2xl'>Ausbildung Benutzeroberflächendesigner</p>
                <svg xmlns="http://www.w3.org/2000/svg" width="30" height="30" viewBox="0 0 30 30" fill="none">
                  <path opacity="0.5" d="M2.5 15C2.5 8.09625 8.09625 2.5 15 2.5C21.9037 2.5 27.5 8.09625 27.5 15C27.5 21.9037 21.9037 27.5 15 27.5C8.09625 27.5 2.5 21.9037 2.5 15Z" fill="#EC3A4C"/>
                  <path fill-rule="evenodd" clip-rule="evenodd" d="M14.6475 9.01865C14.7086 8.78375 14.6762 8.53432 14.5571 8.32282C14.4381 8.11132 14.2416 7.95424 14.0091 7.88462C13.7766 7.81499 13.5261 7.83826 13.3104 7.94951C13.0947 8.06076 12.9306 8.25134 12.8525 8.48115L11.9275 11.5624H8.75C8.50136 11.5624 8.2629 11.6612 8.08709 11.837C7.91127 12.0128 7.8125 12.2513 7.8125 12.4999C7.8125 12.7485 7.91127 12.987 8.08709 13.1628C8.2629 13.3386 8.50136 13.4374 8.75 13.4374H11.365L10.4275 16.5624H7.5C7.25136 16.5624 7.0129 16.6612 6.83709 16.837C6.66127 17.0128 6.5625 17.2513 6.5625 17.4999C6.5625 17.7485 6.66127 17.987 6.83709 18.1628C7.0129 18.3386 7.25136 18.4374 7.5 18.4374H9.865L9.1025 20.9799C9.0397 21.2153 9.071 21.4659 9.18977 21.6786C9.30855 21.8913 9.50547 22.0495 9.73881 22.1195C9.97216 22.1895 10.2236 22.166 10.4399 22.0538C10.6562 21.9417 10.8203 21.7497 10.8975 21.5186L11.8225 18.4374H16.115L15.3525 20.9799C15.2897 21.2153 15.321 21.4659 15.4398 21.6786C15.5585 21.8913 15.7555 22.0495 15.9888 22.1195C16.2222 22.1895 16.4736 22.166 16.6899 22.0538C16.9062 21.9417 17.0703 21.7497 17.1475 21.5186L18.0725 18.4374H21.25C21.4986 18.4374 21.7371 18.3386 21.9129 18.1628C22.0887 17.987 22.1875 17.7485 22.1875 17.4999C22.1875 17.2513 22.0887 17.0128 21.9129 16.837C21.7371 16.6612 21.4986 16.5624 21.25 16.5624H18.635L19.5725 13.4374H22.5C22.7486 13.4374 22.9871 13.3386 23.1629 13.1628C23.3387 12.987 23.4375 12.7485 23.4375 12.4999C23.4375 12.2513 23.3387 12.0128 23.1629 11.837C22.9871 11.6612 22.7486 11.5624 22.5 11.5624H20.135L20.8975 9.01865C20.9586 8.78375 20.9262 8.53432 20.8071 8.32282C20.6881 8.11132 20.4916 7.95424 20.2591 7.88462C20.0266 7.81499 19.7761 7.83826 19.5604 7.94951C19.3447 8.06076 19.1806 8.25134 19.1025 8.48115L18.1775 11.5624H13.885L14.6475 9.01865ZM17.615 13.4374L16.6775 16.5624H12.385L13.3225 13.4374H17.615Z" fill="#EC3A4C"/>
                </svg>
              </div>
            </div>
            <div className='w-full inline-flex items-start gap-7 my-10'>
              <div className='inline-flex flex-col w-3/4 h-full gap-7'>
                <img src={single_course} className='rounded-xl w-full' alt='' />
                <div className='inline-flex flex-col items-center border border-gray-300 bg-white rounded-xl h-max'>
                  <div className='w-full justify-between items-center inline-flex pl-3 border-b'>
                    <div className='inline-flex justify-between h-max'>
                      <span className='bg-primary-default text-white px-8 py-4 rounded-t-xl'>توضیحات</span>
                      <span className='bg-transparent text-gray-800 px-8 py-4 rounded-t-xl'>میزان درآمد</span>
                      <span className='bg-transparent text-gray-800 px-8 py-4 rounded-t-xl'>مسیر شغلی</span>
                    </div>
                    <div className='inline-flex items-center gap-2 px-3 h-max py-2 rounded-lg bg-gray-100 text-gray-700'>
                      <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
                        <path d="M11 17H13V11H11V17ZM12 9C12.2833 9 12.521 8.904 12.713 8.712C12.905 8.52 13.0007 8.28267 13 8C13 7.71667 12.904 7.479 12.712 7.287C12.52 7.095 12.2827 6.99933 12 7C11.7167 7 11.479 7.096 11.287 7.288C11.095 7.48 10.9993 7.71733 11 8C11 8.28333 11.096 8.521 11.288 8.713C11.48 8.905 11.7173 9.00067 12 9ZM12 22C10.6167 22 9.31667 21.7373 8.1 21.212C6.88333 20.6867 5.825 19.9743 4.925 19.075C4.025 18.175 3.31267 17.1167 2.788 15.9C2.26333 14.6833 2.00067 13.3833 2 12C2 10.6167 2.26267 9.31667 2.788 8.1C3.31333 6.88333 4.02567 5.825 4.925 4.925C5.825 4.025 6.88333 3.31267 8.1 2.788C9.31667 2.26333 10.6167 2.00067 12 2C13.3833 2 14.6833 2.26267 15.9 2.788C17.1167 3.31333 18.175 4.02567 19.075 4.925C19.975 5.825 20.6877 6.88333 21.213 8.1C21.7383 9.31667 22.0007 10.6167 22 12C22 13.3833 21.7373 14.6833 21.212 15.9C20.6867 17.1167 19.9743 18.175 19.075 19.075C18.175 19.975 17.1167 20.6877 15.9 21.213C14.6833 21.7383 13.3833 22.0007 12 22ZM12 20C14.2333 20 16.125 19.225 17.675 17.675C19.225 16.125 20 14.2333 20 12C20 9.76667 19.225 7.875 17.675 6.325C16.125 4.775 14.2333 4 12 4C9.76667 4 7.875 4.775 6.325 6.325C4.775 7.875 4 9.76667 4 12C4 14.2333 4.775 16.125 6.325 17.675C7.875 19.225 9.76667 20 12 20Z" fill="black"/>
                      </svg>
                      یافتن کارفرما 
                    </div>
                  </div>
                  <div className='w-full inline-flex flex-col gap-4 text-right px-10 py-10'>
                    <h6 className='text-primary-default text-2xl'>آوسبیلدونگ طراح رابط کاربری چیست؟</h6>
                    <p className="text-gray-700 leading-9">لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.</p>
                    
                    <h6 className='text-primary-default text-2xl mt-5'>وظایف طراح رابط کاربری چیست؟</h6>
                    <p className="text-gray-700 leading-9">لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای است.</p>
                    
                    <h6 className='text-primary-default text-2xl mt-5'>حوزه های تخصصی طراح رابط کاربری چیست؟</h6>
                    <p className="text-gray-700 leading-9">لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای است.</p>
                    <p className="text-gray-700 leading-9">لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.</p>
                    
                    <h6 className='text-primary-default text-2xl mt-5'>میزان درآمد در این رشته چقدر است؟</h6>
                    <p className="text-gray-700 leading-9">لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای است.</p>
                    
                    <div className='inline-flex justify-around pt-10'>
                      <div className='inline-flex gap-2 bg-gray-100 px-12 pt-8 pb-5 relative items-center rounded-md'>
                        <svg xmlns="http://www.w3.org/2000/svg" width="36" height="36" viewBox="0 0 36 36" fill="none">
                          <path d="M22.5734 8.22042H26.6836V6.02832H22.5734C17.5215 6.02832 13.2026 9.22446 11.5311 13.7007H8.05078V15.8927H10.9479C10.7386 17.1629 10.7386 18.4588 10.9479 19.7289H8.05078V21.921H11.5311C13.2025 26.3972 17.5215 29.5933 22.5738 29.5933H26.6839V27.4013H22.5734C20.7591 27.3996 18.9823 26.8839 17.449 25.914C15.9156 24.9441 14.6884 23.5597 13.9096 21.921H24.4915V19.7289H13.1758C12.9187 18.4631 12.9187 17.1585 13.1758 15.8927H24.4915V13.7007H13.9096C14.6884 12.062 15.9156 10.6775 17.449 9.70763C18.9823 8.73773 20.7591 8.22208 22.5734 8.22042Z" fill="#333333"/>
                        </svg>
                        <span className='text-2xl'>638-1100</span>
                        <span className='text-primary-default text-2xl absolute left-1/2 -translate-x-1/2 -top-5 font-bold'>سال اول</span>
                      </div>
                      <div className='inline-flex gap-2 bg-gray-100 px-12 pt-8 pb-5 relative items-center rounded-md'>
                        <svg xmlns="http://www.w3.org/2000/svg" width="36" height="36" viewBox="0 0 36 36" fill="none">
                          <path d="M22.5734 8.22042H26.6836V6.02832H22.5734C17.5215 6.02832 13.2026 9.22446 11.5311 13.7007H8.05078V15.8927H10.9479C10.7386 17.1629 10.7386 18.4588 10.9479 19.7289H8.05078V21.921H11.5311C13.2025 26.3972 17.5215 29.5933 22.5738 29.5933H26.6839V27.4013H22.5734C20.7591 27.3996 18.9823 26.8839 17.449 25.914C15.9156 24.9441 14.6884 23.5597 13.9096 21.921H24.4915V19.7289H13.1758C12.9187 18.4631 12.9187 17.1585 13.1758 15.8927H24.4915V13.7007H13.9096C14.6884 12.062 15.9156 10.6775 17.449 9.70763C18.9823 8.73773 20.7591 8.22208 22.5734 8.22042Z" fill="#333333"/>
                        </svg>
                        <span className='text-2xl'>638-1100</span>
                        <span className='text-primary-default text-2xl absolute left-1/2 -translate-x-1/2 -top-5 font-bold'>سال اول</span>
                      </div>
                      <div className='inline-flex gap-2 bg-gray-100 px-12 pt-8 pb-5 relative items-center rounded-md'>
                        <svg xmlns="http://www.w3.org/2000/svg" width="36" height="36" viewBox="0 0 36 36" fill="none">
                          <path d="M22.5734 8.22042H26.6836V6.02832H22.5734C17.5215 6.02832 13.2026 9.22446 11.5311 13.7007H8.05078V15.8927H10.9479C10.7386 17.1629 10.7386 18.4588 10.9479 19.7289H8.05078V21.921H11.5311C13.2025 26.3972 17.5215 29.5933 22.5738 29.5933H26.6839V27.4013H22.5734C20.7591 27.3996 18.9823 26.8839 17.449 25.914C15.9156 24.9441 14.6884 23.5597 13.9096 21.921H24.4915V19.7289H13.1758C12.9187 18.4631 12.9187 17.1585 13.1758 15.8927H24.4915V13.7007H13.9096C14.6884 12.062 15.9156 10.6775 17.449 9.70763C18.9823 8.73773 20.7591 8.22208 22.5734 8.22042Z" fill="#333333"/>
                        </svg>
                        <span className='text-2xl'>638-1100</span>
                        <span className='text-primary-default text-2xl absolute left-1/2 -translate-x-1/2 -top-5 font-bold'>سال اول</span>
                      </div>
                    </div>

                    <h6 className='text-primary-default text-2xl mt-5'>مزایا و معایب این رشته چیست؟</h6>
                    <p className="text-gray-700 leading-9">لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای است.</p>
                    
                    <div className='inline-flex justify-center gap-10 py-8'>
                      <section className='inline-flex flex-col'>
                        <h6 className='inline-flex gap-2 items-center w-max bg-green-500 text-white px-4 py-2 rounded-t-lg'>
                          <i>
                            <svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 20 20" fill="none">
                              <path opacity="0.2" d="M18.125 4.375V15.625C18.125 15.9565 17.9933 16.2745 17.7589 16.5089C17.5245 16.7433 17.2065 16.875 16.875 16.875H3.125C2.79348 16.875 2.47554 16.7433 2.24112 16.5089C2.0067 16.2745 1.875 15.9565 1.875 15.625V4.375C1.875 4.04348 2.0067 3.72554 2.24112 3.49112C2.47554 3.2567 2.79348 3.125 3.125 3.125H16.875C17.2065 3.125 17.5245 3.2567 17.7589 3.49112C17.9933 3.72554 18.125 4.04348 18.125 4.375Z" fill="white"/>
                              <path d="M16.0675 6.69229L8.56754 14.1923C8.50949 14.2504 8.44056 14.2965 8.36469 14.328C8.28881 14.3594 8.20748 14.3756 8.12535 14.3756C8.04321 14.3756 7.96188 14.3594 7.88601 14.328C7.81014 14.2965 7.74121 14.2504 7.68316 14.1923L4.55816 11.0673C4.44088 10.95 4.375 10.791 4.375 10.6251C4.375 10.4593 4.44088 10.3002 4.55816 10.1829C4.67544 10.0656 4.8345 9.99976 5.00035 9.99976C5.1662 9.99976 5.32526 10.0656 5.44254 10.1829L8.12535 12.8665L15.1832 5.80792C15.3004 5.69064 15.4595 5.62476 15.6253 5.62476C15.7912 5.62476 15.9503 5.69064 16.0675 5.80792C16.1848 5.92519 16.2507 6.08425 16.2507 6.2501C16.2507 6.41596 16.1848 6.57502 16.0675 6.69229Z" fill="white"/>
                            </svg>
                          </i>
                          مــزایــا
                        </h6>
                        <ul className='bg-gray-100 inline-flex flex-col px-6 py-4 gap-8 rounded-xl rounded-tr-none'>
                          <li className='inline-flex items-center gap-3'>
                            <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
                              <rect width="24" height="24" rx="5" fill="#D4F1DC"/>
                              <path fill-rule="evenodd" clip-rule="evenodd" d="M6 10L4 12L10 18L20 8L18 6L10 14L6 10Z" fill="#25B44D"/>
                            </svg>
                            <span>بازار کار  خوب در کشور آلمان و درآمد خوب در سال اول</span>
                          </li>
                          <li className='inline-flex items-center gap-3'>
                            <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
                              <rect width="24" height="24" rx="5" fill="#D4F1DC"/>
                              <path fill-rule="evenodd" clip-rule="evenodd" d="M6 10L4 12L10 18L20 8L18 6L10 14L6 10Z" fill="#25B44D"/>
                            </svg>
                            <span>بازار کار  خوب در کشور آلمان و درآمد خوب در سال اول</span>
                          </li>
                          <li className='inline-flex items-center gap-3'>
                            <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
                              <rect width="24" height="24" rx="5" fill="#D4F1DC"/>
                              <path fill-rule="evenodd" clip-rule="evenodd" d="M6 10L4 12L10 18L20 8L18 6L10 14L6 10Z" fill="#25B44D"/>
                            </svg>
                            <span>بازار کار  خوب در کشور آلمان و درآمد خوب در سال اول</span>
                          </li>
                          <li className='inline-flex items-center gap-3'>
                            <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
                              <rect width="24" height="24" rx="5" fill="#D4F1DC"/>
                              <path fill-rule="evenodd" clip-rule="evenodd" d="M6 10L4 12L10 18L20 8L18 6L10 14L6 10Z" fill="#25B44D"/>
                            </svg>
                            <span>بازار کار  خوب در کشور آلمان و درآمد خوب در سال اول</span>
                          </li>
                          <li className='inline-flex items-center gap-3'>
                            <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
                              <rect width="24" height="24" rx="5" fill="#D4F1DC"/>
                              <path fill-rule="evenodd" clip-rule="evenodd" d="M6 10L4 12L10 18L20 8L18 6L10 14L6 10Z" fill="#25B44D"/>
                            </svg>
                            <span>بازار کار  خوب در کشور آلمان و درآمد خوب در سال اول</span>
                          </li>
                        </ul>
                      </section>
                      <section className='inline-flex flex-col'>
                        <h6 className='inline-flex gap-2 items-center w-max bg-red-500 text-white px-4 py-2 rounded-t-lg'>
                          <i>
                            <svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 20 20" fill="none">
                              <path opacity="0.2" d="M16.875 3.75V16.25C16.875 16.4158 16.8092 16.5747 16.6919 16.6919C16.5747 16.8092 16.4158 16.875 16.25 16.875H3.75C3.58424 16.875 3.42527 16.8092 3.30806 16.6919C3.19085 16.5747 3.125 16.4158 3.125 16.25V3.75C3.125 3.58424 3.19085 3.42527 3.30806 3.30806C3.42527 3.19085 3.58424 3.125 3.75 3.125H16.25C16.4158 3.125 16.5747 3.19085 16.6919 3.30806C16.8092 3.42527 16.875 3.58424 16.875 3.75Z" fill="white"/>
                              <path d="M12.9121 12.4876C12.94 12.5155 12.9621 12.5486 12.9772 12.585C12.9922 12.6214 13 12.6604 13 12.6998C13 12.7393 12.9922 12.7783 12.9772 12.8147C12.9621 12.8511 12.94 12.8842 12.9121 12.9121C12.8842 12.94 12.8511 12.9621 12.8147 12.9772C12.7783 12.9922 12.7393 13 12.6998 13C12.6604 13 12.6214 12.9922 12.585 12.9772C12.5486 12.9621 12.5155 12.94 12.4876 12.9121L10 10.4241L7.51239 12.9121C7.4561 12.9684 7.37975 13 7.30015 13C7.22055 13 7.1442 12.9684 7.08791 12.9121C7.03162 12.8558 7 12.7795 7 12.6998C7 12.6202 7.03162 12.5439 7.08791 12.4876L9.5759 10L7.08791 7.51239C7.03162 7.4561 7 7.37975 7 7.30015C7 7.22055 7.03162 7.1442 7.08791 7.08791C7.1442 7.03162 7.22055 7 7.30015 7C7.37975 7 7.4561 7.03162 7.51239 7.08791L10 9.5759L12.4876 7.08791C12.5439 7.03162 12.6202 7 12.6998 7C12.7795 7 12.8558 7.03162 12.9121 7.08791C12.9684 7.1442 13 7.22055 13 7.30015C13 7.37975 12.9684 7.4561 12.9121 7.51239L10.4241 10L12.9121 12.4876Z" fill="white"/>
                            </svg>
                          </i>
                          معایب
                        </h6>
                        <ul className='bg-gray-100 inline-flex flex-col px-6 py-4 gap-8 rounded-xl rounded-tr-none'>
                          <li className='inline-flex items-center gap-3'>
                            <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
                              <rect width="24" height="24" rx="5" fill="#F1D4D4"/>
                              <path d="M16.8535 16.146C16.8999 16.1925 16.9368 16.2476 16.9619 16.3083C16.9871 16.369 17 16.4341 17 16.4997C17 16.5654 16.9871 16.6305 16.9619 16.6912C16.9368 16.7519 16.8999 16.807 16.8535 16.8535C16.807 16.8999 16.7519 16.9368 16.6912 16.9619C16.6305 16.9871 16.5654 17 16.4997 17C16.4341 17 16.369 16.9871 16.3083 16.9619C16.2476 16.9368 16.1925 16.8999 16.146 16.8535L12 12.7068L7.85398 16.8535C7.76017 16.9473 7.63292 17 7.50025 17C7.36758 17 7.24033 16.9473 7.14652 16.8535C7.0527 16.7597 7 16.6324 7 16.4997C7 16.3671 7.0527 16.2398 7.14652 16.146L11.2932 12L7.14652 7.85398C7.0527 7.76017 7 7.63292 7 7.50025C7 7.36758 7.0527 7.24033 7.14652 7.14652C7.24033 7.0527 7.36758 7 7.50025 7C7.63292 7 7.76017 7.0527 7.85398 7.14652L12 11.2932L16.146 7.14652C16.2398 7.0527 16.3671 7 16.4997 7C16.6324 7 16.7597 7.0527 16.8535 7.14652C16.9473 7.24033 17 7.36758 17 7.50025C17 7.63292 16.9473 7.76017 16.8535 7.85398L12.7068 12L16.8535 16.146Z" fill="#EC3A4C"/>
                            </svg>
                            <span>بازار کار  خوب در کشور آلمان و درآمد خوب در سال اول</span>
                          </li>
                          <li className='inline-flex items-center gap-3'>
                            <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
                              <rect width="24" height="24" rx="5" fill="#F1D4D4"/>
                              <path d="M16.8535 16.146C16.8999 16.1925 16.9368 16.2476 16.9619 16.3083C16.9871 16.369 17 16.4341 17 16.4997C17 16.5654 16.9871 16.6305 16.9619 16.6912C16.9368 16.7519 16.8999 16.807 16.8535 16.8535C16.807 16.8999 16.7519 16.9368 16.6912 16.9619C16.6305 16.9871 16.5654 17 16.4997 17C16.4341 17 16.369 16.9871 16.3083 16.9619C16.2476 16.9368 16.1925 16.8999 16.146 16.8535L12 12.7068L7.85398 16.8535C7.76017 16.9473 7.63292 17 7.50025 17C7.36758 17 7.24033 16.9473 7.14652 16.8535C7.0527 16.7597 7 16.6324 7 16.4997C7 16.3671 7.0527 16.2398 7.14652 16.146L11.2932 12L7.14652 7.85398C7.0527 7.76017 7 7.63292 7 7.50025C7 7.36758 7.0527 7.24033 7.14652 7.14652C7.24033 7.0527 7.36758 7 7.50025 7C7.63292 7 7.76017 7.0527 7.85398 7.14652L12 11.2932L16.146 7.14652C16.2398 7.0527 16.3671 7 16.4997 7C16.6324 7 16.7597 7.0527 16.8535 7.14652C16.9473 7.24033 17 7.36758 17 7.50025C17 7.63292 16.9473 7.76017 16.8535 7.85398L12.7068 12L16.8535 16.146Z" fill="#EC3A4C"/>
                            </svg>
                            <span>بازار کار  خوب در کشور آلمان و درآمد خوب در سال اول</span>
                          </li>
                          <li className='inline-flex items-center gap-3'>
                            <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
                              <rect width="24" height="24" rx="5" fill="#F1D4D4"/>
                              <path d="M16.8535 16.146C16.8999 16.1925 16.9368 16.2476 16.9619 16.3083C16.9871 16.369 17 16.4341 17 16.4997C17 16.5654 16.9871 16.6305 16.9619 16.6912C16.9368 16.7519 16.8999 16.807 16.8535 16.8535C16.807 16.8999 16.7519 16.9368 16.6912 16.9619C16.6305 16.9871 16.5654 17 16.4997 17C16.4341 17 16.369 16.9871 16.3083 16.9619C16.2476 16.9368 16.1925 16.8999 16.146 16.8535L12 12.7068L7.85398 16.8535C7.76017 16.9473 7.63292 17 7.50025 17C7.36758 17 7.24033 16.9473 7.14652 16.8535C7.0527 16.7597 7 16.6324 7 16.4997C7 16.3671 7.0527 16.2398 7.14652 16.146L11.2932 12L7.14652 7.85398C7.0527 7.76017 7 7.63292 7 7.50025C7 7.36758 7.0527 7.24033 7.14652 7.14652C7.24033 7.0527 7.36758 7 7.50025 7C7.63292 7 7.76017 7.0527 7.85398 7.14652L12 11.2932L16.146 7.14652C16.2398 7.0527 16.3671 7 16.4997 7C16.6324 7 16.7597 7.0527 16.8535 7.14652C16.9473 7.24033 17 7.36758 17 7.50025C17 7.63292 16.9473 7.76017 16.8535 7.85398L12.7068 12L16.8535 16.146Z" fill="#EC3A4C"/>
                            </svg>
                            <span>بازار کار  خوب در کشور آلمان و درآمد خوب در سال اول</span>
                          </li>
                          <li className='inline-flex items-center gap-3'>
                            <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
                              <rect width="24" height="24" rx="5" fill="#F1D4D4"/>
                              <path d="M16.8535 16.146C16.8999 16.1925 16.9368 16.2476 16.9619 16.3083C16.9871 16.369 17 16.4341 17 16.4997C17 16.5654 16.9871 16.6305 16.9619 16.6912C16.9368 16.7519 16.8999 16.807 16.8535 16.8535C16.807 16.8999 16.7519 16.9368 16.6912 16.9619C16.6305 16.9871 16.5654 17 16.4997 17C16.4341 17 16.369 16.9871 16.3083 16.9619C16.2476 16.9368 16.1925 16.8999 16.146 16.8535L12 12.7068L7.85398 16.8535C7.76017 16.9473 7.63292 17 7.50025 17C7.36758 17 7.24033 16.9473 7.14652 16.8535C7.0527 16.7597 7 16.6324 7 16.4997C7 16.3671 7.0527 16.2398 7.14652 16.146L11.2932 12L7.14652 7.85398C7.0527 7.76017 7 7.63292 7 7.50025C7 7.36758 7.0527 7.24033 7.14652 7.14652C7.24033 7.0527 7.36758 7 7.50025 7C7.63292 7 7.76017 7.0527 7.85398 7.14652L12 11.2932L16.146 7.14652C16.2398 7.0527 16.3671 7 16.4997 7C16.6324 7 16.7597 7.0527 16.8535 7.14652C16.9473 7.24033 17 7.36758 17 7.50025C17 7.63292 16.9473 7.76017 16.8535 7.85398L12.7068 12L16.8535 16.146Z" fill="#EC3A4C"/>
                            </svg>
                            <span>بازار کار  خوب در کشور آلمان و درآمد خوب در سال اول</span>
                          </li>
                          <li className='inline-flex items-center gap-3'>
                            <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
                              <rect width="24" height="24" rx="5" fill="#F1D4D4"/>
                              <path d="M16.8535 16.146C16.8999 16.1925 16.9368 16.2476 16.9619 16.3083C16.9871 16.369 17 16.4341 17 16.4997C17 16.5654 16.9871 16.6305 16.9619 16.6912C16.9368 16.7519 16.8999 16.807 16.8535 16.8535C16.807 16.8999 16.7519 16.9368 16.6912 16.9619C16.6305 16.9871 16.5654 17 16.4997 17C16.4341 17 16.369 16.9871 16.3083 16.9619C16.2476 16.9368 16.1925 16.8999 16.146 16.8535L12 12.7068L7.85398 16.8535C7.76017 16.9473 7.63292 17 7.50025 17C7.36758 17 7.24033 16.9473 7.14652 16.8535C7.0527 16.7597 7 16.6324 7 16.4997C7 16.3671 7.0527 16.2398 7.14652 16.146L11.2932 12L7.14652 7.85398C7.0527 7.76017 7 7.63292 7 7.50025C7 7.36758 7.0527 7.24033 7.14652 7.14652C7.24033 7.0527 7.36758 7 7.50025 7C7.63292 7 7.76017 7.0527 7.85398 7.14652L12 11.2932L16.146 7.14652C16.2398 7.0527 16.3671 7 16.4997 7C16.6324 7 16.7597 7.0527 16.8535 7.14652C16.9473 7.24033 17 7.36758 17 7.50025C17 7.63292 16.9473 7.76017 16.8535 7.85398L12.7068 12L16.8535 16.146Z" fill="#EC3A4C"/>
                            </svg>
                            <span>بازار کار  خوب در کشور آلمان و درآمد خوب در سال اول</span>
                          </li>
                        </ul>
                      </section>
                    </div>
                  </div>
                  <div className='w-full flex justify-between border-t p-4 border-gray-100'>
                    <div className='inline-flex items-center gap-3'>
                      <span className='text-gray-600 text-lg rounded-3xl'>برچسب ها:</span>
                      <span className='bg-gray-100 text-gray-500 rounded-3xl px-5 py-2 text-sm'>فلان چیز</span>
                      <span className='bg-gray-100 text-gray-500 rounded-3xl px-5 py-2 text-sm'>فلان چیز</span>
                      <span className='bg-gray-100 text-gray-500 rounded-3xl px-5 py-2 text-sm'>فلان چیز</span>
                    </div>
                    <div className='inline-flex items-center gap-4'>
                      <div className='flex items-center gap-1'>
                        <span className='text-gray-800'>منبع:</span>
                        <a href='https://www.ausbildung.de/' target="_blank" rel="noreferrer" className='text-primary-default hover:underline underline-offset-1'>Ausbildung.de</a>
                      </div>
                      <span className='h-full w-1 border-r border-gray-100'></span>
                      <div className='flex items-center gap-1'>
                        <svg xmlns="http://www.w3.org/2000/svg" width="34" height="34" viewBox="0 0 34 34" fill="none">
                          <rect x="0.0332031" width="33.9672" height="33.9672" rx="6.06556" fill="white" fill-opacity="0.8"/>
                          <path d="M23.5018 26.6866C23.1467 26.6866 22.807 26.5897 22.4828 26.3959L17.4032 23.2636C17.2832 23.1921 17.1475 23.1545 17.0094 23.1545C16.8714 23.1545 16.7357 23.1921 16.6157 23.2636L11.5361 26.3959C10.9031 26.7834 10.162 26.7834 9.52896 26.4121C8.89594 26.0407 8.52539 25.3464 8.52539 24.5876V9.70074C8.52539 8.36061 9.55984 7.27881 10.8413 7.27881H23.193C24.4745 7.27881 25.5089 8.36061 25.5089 9.70074V24.5876C25.5104 24.8623 25.4599 25.1346 25.3605 25.3888C25.2611 25.6431 25.1147 25.8744 24.9297 26.0694C24.7447 26.2644 24.5247 26.4193 24.2823 26.5252C24.0399 26.6311 23.7799 26.6859 23.5172 26.6866H23.5018ZM17.0172 21.5198C17.4186 21.5198 17.8355 21.6328 18.1906 21.8588L23.2702 24.9912C23.4709 25.1204 23.6562 25.0397 23.7334 24.9912C23.8106 24.9428 23.965 24.8298 23.965 24.5714V9.70074C23.965 9.24865 23.6253 8.89343 23.193 8.89343H10.8413C10.409 8.89343 10.0693 9.24865 10.0693 9.70074V24.5876C10.0693 24.8459 10.2237 24.9589 10.3009 25.0074C10.3781 25.0558 10.548 25.1365 10.7641 25.0074L15.8438 21.875C16.2143 21.6489 16.6157 21.5359 17.0172 21.5359V21.5198Z" fill="black"/>
                        </svg>
                        <svg xmlns="http://www.w3.org/2000/svg" width="34" height="34" viewBox="0 0 34 34" fill="none">
                          <rect width="33.9672" height="33.9672" rx="6.06556" fill="white" fill-opacity="0.8"/>
                          <path d="M14.0523 17.2869C14.0523 18.0242 13.7594 18.7313 13.238 19.2527C12.7167 19.774 12.0096 20.0669 11.2722 20.0669C10.5349 20.0669 9.82781 19.774 9.30645 19.2527C8.78508 18.7313 8.49219 18.0242 8.49219 17.2869C8.49219 16.5496 8.78508 15.8425 9.30645 15.3211C9.82781 14.7997 10.5349 14.5068 11.2722 14.5068C12.0096 14.5068 12.7167 14.7997 13.238 15.3211C13.7594 15.8425 14.0523 16.5496 14.0523 17.2869Z" stroke="black" stroke-width="1.51639"/>
                          <path d="M19.6128 11.1707L14.0527 15.0627M19.6128 23.4029L14.0527 19.5108" stroke="black" stroke-width="1.51639" stroke-linecap="round"/>
                          <path d="M25.1734 24.5149C25.1734 25.2522 24.8805 25.9593 24.3591 26.4807C23.8378 27.002 23.1306 27.2949 22.3933 27.2949C21.656 27.2949 20.9489 27.002 20.4275 26.4807C19.9062 25.9593 19.6133 25.2522 19.6133 24.5149C19.6133 23.7776 19.9062 23.0704 20.4275 22.5491C20.9489 22.0277 21.656 21.7348 22.3933 21.7348C23.1306 21.7348 23.8378 22.0277 24.3591 22.5491C24.8805 23.0704 25.1734 23.7776 25.1734 24.5149ZM25.1734 10.0586C25.1734 10.7959 24.8805 11.503 24.3591 12.0244C23.8378 12.5458 23.1306 12.8387 22.3933 12.8387C21.656 12.8387 20.9489 12.5458 20.4275 12.0244C19.9062 11.503 19.6133 10.7959 19.6133 10.0586C19.6133 9.3213 19.9062 8.61418 20.4275 8.09282C20.9489 7.57146 21.656 7.27856 22.3933 7.27856C23.1306 7.27856 23.8378 7.57146 24.3591 8.09282C24.8805 8.61418 25.1734 9.3213 25.1734 10.0586Z" stroke="black" stroke-width="1.51639"/>
                        </svg>
                      </div>
                    </div>
                  </div>
                </div>
              </div>
              <div className='w-1/4 flex flex-col gap-10'>
                <div className='w-full flex flex-col h-full bg-white border-2 border-gray-100 rounded-xl shadow-sm'>
                  <div className='inline-flex items-center gap-2 border-b border-gray-100 px-4 py-4'>
                    <svg xmlns="http://www.w3.org/2000/svg" width="30" height="30" viewBox="0 0 30 30" fill="none">
                      <path d="M15 26.25C21.9036 26.25 27.5 20.6536 27.5 13.75C27.5 6.84644 21.9036 1.25 15 1.25C8.09644 1.25 2.5 6.84644 2.5 13.75C2.5 20.6536 8.09644 26.25 15 26.25Z" fill="#FFF59D"/>
                      <path d="M23.1258 13.75C23.1258 8.9375 19.0008 5.125 14.0633 5.6875C10.3133 6.125 7.31331 9.125 6.93831 12.875C6.62581 15.75 7.81331 18.3125 9.81331 19.9375C10.6883 20.6875 11.2508 21.75 11.2508 22.9375V23.125H18.7508V23.0625C18.7508 21.9375 19.2508 20.8125 20.1258 20.0625C21.9383 18.5625 23.1258 16.3125 23.1258 13.75Z" fill="#FBC02D"/>
                      <path d="M19.125 12.625L17.25 11.375C17.0625 11.25 16.75 11.25 16.5625 11.375L15 12.375L13.5 11.375C13.3125 11.25 13 11.25 12.8125 11.375L10.9375 12.625C10.8125 12.75 10.6875 12.875 10.6875 13.0625C10.6875 13.25 10.6875 13.4375 10.8125 13.5625L13.1875 16.5V23.125H14.4375V16.25C14.4375 16.125 14.375 16 14.3125 15.875L12.25 13.3125L13.1875 12.6875L14.6875 13.6875C14.875 13.8125 15.1875 13.8125 15.375 13.6875L16.875 12.6875L17.8125 13.3125L15.75 15.875C15.6875 16 15.625 16.125 15.625 16.25V23.125H16.875V16.5L19.25 13.5625C19.375 13.4375 19.4375 13.25 19.375 13.0625C19.3125 12.875 19.25 12.6875 19.125 12.625Z" fill="#FFF59D"/>
                      <path d="M15 29.375C16.0355 29.375 16.875 28.5355 16.875 27.5C16.875 26.4645 16.0355 25.625 15 25.625C13.9645 25.625 13.125 26.4645 13.125 27.5C13.125 28.5355 13.9645 29.375 15 29.375Z" fill="#5C6BC0"/>
                      <path d="M16.25 28.125H13.75C12.375 28.125 11.25 27 11.25 25.625V22.5H18.75V25.625C18.75 27 17.625 28.125 16.25 28.125Z" fill="#9FA8DA"/>
                      <path d="M18.75 25.625L11.5 26.625C11.6875 27.0625 12.0625 27.5 12.5 27.75L18.375 26.9375C18.625 26.5625 18.75 26.125 18.75 25.625ZM11.25 24.1875V25.4375L18.75 24.375V23.125L11.25 24.1875Z" fill="#5C6BC0"/>
                    </svg>
                    <span className='text-xl'>اطلاعات شغل</span>
                  </div>
                  <div className='inline-flex border-b border-gray-100 justify-between px-6 py-4'>
                    <div>رشته تحصیلی:</div>
                    <div>رشته های هنری</div>
                  </div>
                  <div className='inline-flex border-b border-gray-100 justify-between px-6 py-4'>
                    <div>نوع رشته:</div>
                    <div>شولیشه</div>
                  </div>
                  <div className='inline-flex border-b border-gray-100 justify-between px-6 py-4'>
                    <div>مدت دوره:</div>
                    <div>3 ساله</div>
                  </div>
                  <div className='inline-flex border-b border-gray-100 justify-between px-6 py-4'>
                    <div>دوره:</div>
                    <div>شیفتی نمیباشد</div>
                  </div>
                  <div className="flex flex-col gap-4 py-5 px-4 pb-3">
                    <div className="w-full inline-flex justify-between bg-gray-100 text-sm py-3 px-4 rounded-md">
                      <span>حقوق سال اول:</span>
                      <span className='inline-flex flex-row-reverse items-center gap-1 justify-center'>
                        638-1100 
                        <svg xmlns="http://www.w3.org/2000/svg" width="15" height="15" viewBox="0 0 15 15" fill="none">
                          <path d="M9.25781 3.51562H11.0156V2.57812H9.25781C7.09726 2.57812 5.25018 3.94503 4.5353 5.85938H3.04688V6.79688H4.2859C4.19637 7.34009 4.19637 7.89429 4.2859 8.4375H3.04688V9.375H4.5353C5.25015 11.2893 7.09726 12.6562 9.25796 12.6562H11.0158V11.7188H9.25781C8.48187 11.718 7.722 11.4975 7.06623 11.0827C6.41046 10.6679 5.88562 10.0758 5.55252 9.375H10.0781V8.4375H5.23872C5.12876 7.89615 5.12876 7.33822 5.23872 6.79688H10.0781V5.85938H5.55252C5.88562 5.15857 6.41046 4.56647 7.06623 4.15167C7.722 3.73686 8.48187 3.51634 9.25781 3.51562Z" fill="#333333"/>
                        </svg>
                      </span>
                    </div>
                    <div className="w-full inline-flex justify-between bg-gray-100 text-sm py-3 px-4 rounded-md">
                      <span>حقوق سال اول:</span>
                      <span className='inline-flex flex-row-reverse items-center gap-1 justify-center'>
                        638-1100 
                        <svg xmlns="http://www.w3.org/2000/svg" width="15" height="15" viewBox="0 0 15 15" fill="none">
                          <path d="M9.25781 3.51562H11.0156V2.57812H9.25781C7.09726 2.57812 5.25018 3.94503 4.5353 5.85938H3.04688V6.79688H4.2859C4.19637 7.34009 4.19637 7.89429 4.2859 8.4375H3.04688V9.375H4.5353C5.25015 11.2893 7.09726 12.6562 9.25796 12.6562H11.0158V11.7188H9.25781C8.48187 11.718 7.722 11.4975 7.06623 11.0827C6.41046 10.6679 5.88562 10.0758 5.55252 9.375H10.0781V8.4375H5.23872C5.12876 7.89615 5.12876 7.33822 5.23872 6.79688H10.0781V5.85938H5.55252C5.88562 5.15857 6.41046 4.56647 7.06623 4.15167C7.722 3.73686 8.48187 3.51634 9.25781 3.51562Z" fill="#333333"/>
                        </svg>
                      </span>
                    </div>
                    <div className="w-full inline-flex justify-between bg-gray-100 text-sm py-3 px-4 rounded-md">
                      <span>حقوق سال اول:</span>
                      <span className='inline-flex flex-row-reverse items-center gap-1 justify-center'>
                        638-1100 
                        <svg xmlns="http://www.w3.org/2000/svg" width="15" height="15" viewBox="0 0 15 15" fill="none">
                          <path d="M9.25781 3.51562H11.0156V2.57812H9.25781C7.09726 2.57812 5.25018 3.94503 4.5353 5.85938H3.04688V6.79688H4.2859C4.19637 7.34009 4.19637 7.89429 4.2859 8.4375H3.04688V9.375H4.5353C5.25015 11.2893 7.09726 12.6562 9.25796 12.6562H11.0158V11.7188H9.25781C8.48187 11.718 7.722 11.4975 7.06623 11.0827C6.41046 10.6679 5.88562 10.0758 5.55252 9.375H10.0781V8.4375H5.23872C5.12876 7.89615 5.12876 7.33822 5.23872 6.79688H10.0781V5.85938H5.55252C5.88562 5.15857 6.41046 4.56647 7.06623 4.15167C7.722 3.73686 8.48187 3.51634 9.25781 3.51562Z" fill="#333333"/>
                        </svg>
                      </span>
                    </div>
                  </div>
                </div>
                <div className='w-full flex flex-col h-full bg-white shadow-lg border-gray-100 rounded-xl shadow-s'>
                  <div className='inline-flex items-center gap-2 border-b bg-primary-default text-white rounded-t-xl border-gray-100 px-4 py-4'>
                    <svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 20 20" fill="none">
                      <rect width="20" height="20" transform="translate(0 20) rotate(-90)" fill="#EC3A4C"/>
                      <path d="M15.8332 17.5002L15.8332 2.50017C15.8327 2.34831 15.7908 2.19944 15.712 2.06961C15.6332 1.93977 15.5205 1.83389 15.386 1.76334C15.2516 1.6928 15.1004 1.66027 14.9488 1.66925C14.7972 1.67824 14.6509 1.7284 14.5257 1.81434L3.69234 9.31434C3.24318 9.62517 3.24318 10.3735 3.69234 10.6852L14.5257 18.1852C14.6506 18.272 14.797 18.3229 14.9488 18.3324C15.1007 18.3418 15.2522 18.3095 15.387 18.2389C15.5218 18.1683 15.6346 18.0621 15.7133 17.9319C15.792 17.8016 15.8334 17.6523 15.8332 17.5002Z" fill="#F6F6F6"/>
                    </svg>
                    <span className='text-xl'>دسترسی سریع</span>
                  </div>
                  <div className='inline-flex border-b border-gray-100 justify-start gap-2 px-6 py-4 items-center'>
                    <svg xmlns="http://www.w3.org/2000/svg" width="8" height="8" viewBox="0 0 8 8" fill="none">
                      <circle cx="4" cy="4" r="4" fill="#EC3A4C"/>
                    </svg>
                    <div>آوسبیلدونگ طراح رابط کاربری چیست؟</div>
                  </div>
                  <div className='inline-flex border-b border-gray-100 justify-start gap-2 px-6 py-4 items-center'>
                    <svg xmlns="http://www.w3.org/2000/svg" width="8" height="8" viewBox="0 0 8 8" fill="none">
                      <circle cx="4" cy="4" r="4" fill="#EC3A4C"/>
                    </svg>
                    <div>وظایف طراح رابط کاربری چیست؟</div>
                  </div>
                  <div className='inline-flex border-b border-gray-100 justify-start gap-2 px-6 py-4 items-center'>
                    <svg xmlns="http://www.w3.org/2000/svg" width="8" height="8" viewBox="0 0 8 8" fill="none">
                      <circle cx="4" cy="4" r="4" fill="#EC3A4C"/>
                    </svg>
                    <div>حوزه های تخصصی طراح رابط کاربری چیست؟</div>
                  </div>
                  <div className='inline-flex border-b border-gray-100 justify-start gap-2 px-6 py-4 items-center'>
                    <svg xmlns="http://www.w3.org/2000/svg" width="8" height="8" viewBox="0 0 8 8" fill="none">
                      <circle cx="4" cy="4" r="4" fill="#EC3A4C"/>
                    </svg>
                    <div>میزان درآمد این رشته چقدر هست؟</div>
                  </div>
                  <div className='inline-flex border-b border-gray-100 justify-start gap-2 px-6 py-4 items-center'>
                    <svg xmlns="http://www.w3.org/2000/svg" width="8" height="8" viewBox="0 0 8 8" fill="none">
                      <circle cx="4" cy="4" r="4" fill="#EC3A4C"/>
                    </svg>
                    <div>مزایا و معایب این رشته چیست؟</div>
                  </div>
                </div>
                <div className='w-full flex flex-col h-full bg-white pt-6 shadow-lg border-gray-100 rounded-xl shadow-s relative mt-6'>
                  <img src={germany} alt='' className='w-28 absolute left-1/2 -translate-x-1/2 -top-14' />
                  <div className='inline-flex justify-center gap-2 px-6 py-10 items-center font-bold text-xl pb-14'>
                    وقتشه به محاجرت آسان فکر کنی
                  </div>
                  <span className='absolute right-12 top-24'>
                    <svg xmlns="http://www.w3.org/2000/svg" width="23" height="50" viewBox="0 0 23 50" fill="none">
                      <path d="M0.512053 47.8909C0.451787 48.1604 0.621393 48.4277 0.890878 48.4879L5.2824 49.47C5.55189 49.5303 5.81921 49.3607 5.87947 49.0912C5.93974 48.8217 5.77013 48.5544 5.50065 48.4941L1.59707 47.6212L2.47004 43.7176C2.53031 43.4481 2.3607 43.1808 2.09122 43.1205C1.82173 43.0603 1.55441 43.2299 1.49415 43.4994L0.512053 47.8909ZM9.14199 42.242L0.73213 47.5778L1.26787 48.4222L9.67773 43.0863L9.14199 42.242ZM14.6303 1.33665C25.9039 13.7165 23.2802 33.2716 9.14199 42.242L9.67773 43.0863C24.3405 33.7832 27.0616 13.5025 15.3697 0.663351L14.6303 1.33665Z" fill="black"/>
                    </svg>
                  </span>
                  <div className='inline-flex flex-col gap-6 mb-12 px-4 items-center'>
                    <Button styleVariant='secondary' className='bg-transparent text-gray-700'>درخواست مشاوره</Button>
                    <Button styleVariant='secondary' className='bg-transparent text-gray-700'>نگارش  رزومه و انگیزه نامه</Button>
                    <Button styleVariant='secondary' className='bg-transparent text-gray-700'>شرایط پذیرش پرونده و مهاجرت</Button>
                  </div>
                </div>
                <div className='w-full flex flex-col h-full bg-white shadow-lg border-gray-100 rounded-xl shadow-s'>
                  <div className='inline-flex items-center gap-2 border-b bg-primary-default text-white rounded-t-xl border-gray-100 px-4 py-4'>
                    <svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 20 20" fill="none">
                      <rect width="20" height="20" transform="translate(0 20) rotate(-90)" fill="#EC3A4C"/>
                      <path d="M15.8332 17.5002L15.8332 2.50017C15.8327 2.34831 15.7908 2.19944 15.712 2.06961C15.6332 1.93977 15.5205 1.83389 15.386 1.76334C15.2516 1.6928 15.1004 1.66027 14.9488 1.66925C14.7972 1.67824 14.6509 1.7284 14.5257 1.81434L3.69234 9.31434C3.24318 9.62517 3.24318 10.3735 3.69234 10.6852L14.5257 18.1852C14.6506 18.272 14.797 18.3229 14.9488 18.3324C15.1007 18.3418 15.2522 18.3095 15.387 18.2389C15.5218 18.1683 15.6346 18.0621 15.7133 17.9319C15.792 17.8016 15.8334 17.6523 15.8332 17.5002Z" fill="#F6F6F6"/>
                    </svg>
                    <span className='text-xl'>آوسبیلدونگ های مشابه</span>
                  </div>
                  <div className='inline-flex border-b border-gray-100 justify-between gap-2 p-4 items-center'>
                    <div className='inline-flex gap-4'>
                      <img src={single_course} alt='' className='w-16 h-16 rounded-lg' />
                      <div className='inline-flex flex-col items-start justify-around gap-1'>
                        <p className='text-gray-900 text-lg'>پیرا پزشکی</p>
                        <p className='text-primary-default text-base'>Gesundheitswesen</p>
                      </div>
                    </div>
                    <span className='bg-gray-100 p-1 rounded-lg'>
                      <svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 20 20" fill="none">
                        <path d="M9.08084 4.04372C9.16862 4.13161 9.21792 4.25075 9.21792 4.37497C9.21792 4.49919 9.16862 4.61833 9.08084 4.70622L4.25662 9.53122L16.8746 9.53122C16.9989 9.53122 17.1181 9.58061 17.206 9.66852C17.294 9.75642 17.3433 9.87565 17.3433 9.99997C17.3433 10.1243 17.294 10.2435 17.206 10.3314C17.1181 10.4193 16.9989 10.4687 16.8746 10.4687L4.25662 10.4687L9.08084 15.2937C9.16364 15.3826 9.20871 15.5001 9.20657 15.6216C9.20443 15.743 9.15523 15.8589 9.06935 15.9447C8.98347 16.0306 8.8676 16.0798 8.74616 16.082C8.62473 16.0841 8.5072 16.039 8.41834 15.9562L2.79334 10.3312C2.70556 10.2433 2.65625 10.1242 2.65625 9.99997C2.65625 9.87575 2.70556 9.75661 2.79334 9.66872L8.41834 4.04372C8.50623 3.95594 8.62537 3.90664 8.74959 3.90664C8.87381 3.90664 8.99295 3.95594 9.08084 4.04372Z" fill="black"/>
                      </svg>
                    </span>
                  </div>
                  <div className='inline-flex border-b border-gray-100 justify-between gap-2 p-4 items-center'>
                    <div className='inline-flex gap-4'>
                      <img src={single_course} alt='' className='w-16 h-16 rounded-lg' />
                      <div className='inline-flex flex-col items-start justify-around gap-1'>
                        <p className='text-gray-900 text-lg'>پیرا پزشکی</p>
                        <p className='text-primary-default text-base'>Gesundheitswesen</p>
                      </div>
                    </div>
                    <span className='bg-gray-100 p-1 rounded-lg'>
                      <svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 20 20" fill="none">
                        <path d="M9.08084 4.04372C9.16862 4.13161 9.21792 4.25075 9.21792 4.37497C9.21792 4.49919 9.16862 4.61833 9.08084 4.70622L4.25662 9.53122L16.8746 9.53122C16.9989 9.53122 17.1181 9.58061 17.206 9.66852C17.294 9.75642 17.3433 9.87565 17.3433 9.99997C17.3433 10.1243 17.294 10.2435 17.206 10.3314C17.1181 10.4193 16.9989 10.4687 16.8746 10.4687L4.25662 10.4687L9.08084 15.2937C9.16364 15.3826 9.20871 15.5001 9.20657 15.6216C9.20443 15.743 9.15523 15.8589 9.06935 15.9447C8.98347 16.0306 8.8676 16.0798 8.74616 16.082C8.62473 16.0841 8.5072 16.039 8.41834 15.9562L2.79334 10.3312C2.70556 10.2433 2.65625 10.1242 2.65625 9.99997C2.65625 9.87575 2.70556 9.75661 2.79334 9.66872L8.41834 4.04372C8.50623 3.95594 8.62537 3.90664 8.74959 3.90664C8.87381 3.90664 8.99295 3.95594 9.08084 4.04372Z" fill="black"/>
                      </svg>
                    </span>
                  </div>
                  <div className='inline-flex border-b border-gray-100 justify-between gap-2 p-4 items-center'>
                    <div className='inline-flex gap-4'>
                      <img src={single_course} alt='' className='w-16 h-16 rounded-lg' />
                      <div className='inline-flex flex-col items-start justify-around gap-1'>
                        <p className='text-gray-900 text-lg'>پیرا پزشکی</p>
                        <p className='text-primary-default text-base'>Gesundheitswesen</p>
                      </div>
                    </div>
                    <span className='bg-gray-100 p-1 rounded-lg'>
                      <svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 20 20" fill="none">
                        <path d="M9.08084 4.04372C9.16862 4.13161 9.21792 4.25075 9.21792 4.37497C9.21792 4.49919 9.16862 4.61833 9.08084 4.70622L4.25662 9.53122L16.8746 9.53122C16.9989 9.53122 17.1181 9.58061 17.206 9.66852C17.294 9.75642 17.3433 9.87565 17.3433 9.99997C17.3433 10.1243 17.294 10.2435 17.206 10.3314C17.1181 10.4193 16.9989 10.4687 16.8746 10.4687L4.25662 10.4687L9.08084 15.2937C9.16364 15.3826 9.20871 15.5001 9.20657 15.6216C9.20443 15.743 9.15523 15.8589 9.06935 15.9447C8.98347 16.0306 8.8676 16.0798 8.74616 16.082C8.62473 16.0841 8.5072 16.039 8.41834 15.9562L2.79334 10.3312C2.70556 10.2433 2.65625 10.1242 2.65625 9.99997C2.65625 9.87575 2.70556 9.75661 2.79334 9.66872L8.41834 4.04372C8.50623 3.95594 8.62537 3.90664 8.74959 3.90664C8.87381 3.90664 8.99295 3.95594 9.08084 4.04372Z" fill="black"/>
                      </svg>
                    </span>
                  </div>
                  <div className='inline-flex border-b border-gray-100 justify-between gap-2 p-4 items-center'>
                    <div className='inline-flex gap-4'>
                      <img src={single_course} alt='' className='w-16 h-16 rounded-lg' />
                      <div className='inline-flex flex-col items-start justify-around gap-1'>
                        <p className='text-gray-900 text-lg'>پیرا پزشکی</p>
                        <p className='text-primary-default text-base'>Gesundheitswesen</p>
                      </div>
                    </div>
                    <span className='bg-gray-100 p-1 rounded-lg'>
                      <svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 20 20" fill="none">
                        <path d="M9.08084 4.04372C9.16862 4.13161 9.21792 4.25075 9.21792 4.37497C9.21792 4.49919 9.16862 4.61833 9.08084 4.70622L4.25662 9.53122L16.8746 9.53122C16.9989 9.53122 17.1181 9.58061 17.206 9.66852C17.294 9.75642 17.3433 9.87565 17.3433 9.99997C17.3433 10.1243 17.294 10.2435 17.206 10.3314C17.1181 10.4193 16.9989 10.4687 16.8746 10.4687L4.25662 10.4687L9.08084 15.2937C9.16364 15.3826 9.20871 15.5001 9.20657 15.6216C9.20443 15.743 9.15523 15.8589 9.06935 15.9447C8.98347 16.0306 8.8676 16.0798 8.74616 16.082C8.62473 16.0841 8.5072 16.039 8.41834 15.9562L2.79334 10.3312C2.70556 10.2433 2.65625 10.1242 2.65625 9.99997C2.65625 9.87575 2.70556 9.75661 2.79334 9.66872L8.41834 4.04372C8.50623 3.95594 8.62537 3.90664 8.74959 3.90664C8.87381 3.90664 8.99295 3.95594 9.08084 4.04372Z" fill="black"/>
                      </svg>
                    </span>
                  </div>
                </div>
              </div>
            </div>
            <Social/>
            <div className='w-full inline-flex items-start gap-7 my-10'>
              <div className='inline-flex flex-col w-3/4 h-full gap-7'>
                <div className='inline-flex flex-col items-center gap-4 shadow-md p-7 bg-white rounded-lg h-max'>
                  <div className='w-full inline-flex flex-row gap-2 items-center justify-start p-2 pb-8'>
                    <svg xmlns="http://www.w3.org/2000/svg" width="30" height="30" viewBox="0 0 30 30" fill="none">
                      <path d="M8.75 8.75H21.25V11.25H8.75V8.75ZM8.75 13.75H17.5V16.25H8.75V13.75Z" fill="black"/>
                      <path d="M25 2.5H5C3.62125 2.5 2.5 3.62125 2.5 5V27.5L9.16625 22.5H25C26.3787 22.5 27.5 21.3787 27.5 20V5C27.5 3.62125 26.3787 2.5 25 2.5ZM25 20H8.33375L5 22.5V5H25V20Z" fill="black"/>
                    </svg>
                    <span className='text-2xl'>دیدگاه خود را بنویسید</span>
                  </div>
                  <div className='w-full inline-flex gap-4'>
                    <input className='bg-gray-100 text-gray-600 placeholder:text-gray-300 p-5 rounded-lg outline-none w-1/3' placeholder='نام خود را وارد کنید' />
                    <input className='bg-gray-100 text-gray-600 placeholder:text-gray-300 p-5 rounded-lg outline-none w-1/3' placeholder='ایمیل خود را وارد کنید' />
                  </div>
                  <div className='w-full h-max'>
                    <textarea className='bg-gray-100 text-gray-600 placeholder:text-gray-300 p-5 rounded-lg outline-none w-full h-48' placeholder='دیدگاه خود را بنویسید' />
                  </div>
                  <div className='w-full inline-flex justify-end'>
                    <Button>ارسال نظر</Button>
                  </div>
                  <div className='w-full flex flex-col gap-4 py-8'>
                    <div className='w-full border border-gray-200 rounded-2xl flex flex-col gap-4 px-7 pt-6 pb-4'>
                      <div className='w-full flex justify-between items-center'>
                        <div className='flex flex-row gap-2 items-center'>
                          <img src={person1} className='w-14 h-14 rounded-2xl border-4 border-gray-200' alt='' />
                          <div className='flex flex-col gap-3 justify-around'>
                            <span className='text-lg text-gray-800'>مریم محمدی</span>
                            <span className='text-xs text-gray-300'>کاربر آوسبیلدونگ</span>
                          </div>
                        </div>
                        <div className='inline-flex gap-3 h-max'>
                          <Button
                            styleVariant='textonly'
                            size='small'
                            leftIcon={
                              <img src={like} alt='' />
                            }
                          >2</Button>
                          <Button
                            styleVariant='textonly'
                            size='small'
                            leftIcon={
                              <img src={like} alt='' className='rotate-180' />
                            }
                          >2</Button>
                        </div>
                      </div>
                      <p className='leading-8 text-right text-gray-500'>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای است.</p>
                      <div className='w-full flex justify-end'>
                        <Button
                          styleVariant='textonly'
                          className='text-primary-default'
                          leftIcon={
                            <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
                              <path fill-rule="evenodd" clip-rule="evenodd" d="M20.5402 16.8071C20.6486 16.695 20.7193 16.552 20.7426 16.3979C20.7659 16.2438 20.7406 16.0862 20.6702 15.9471L19.9392 14.5061C19.1252 12.8982 17.8814 11.5473 16.3459 10.6036C14.8105 9.6599 13.0435 9.16024 11.2412 9.16011H10.8372C10.8117 8.60669 10.7787 8.05364 10.7382 7.50111L10.6702 6.56211C10.6576 6.38869 10.6001 6.22152 10.5035 6.07698C10.4068 5.93245 10.2743 5.81549 10.1188 5.73757C9.96339 5.65964 9.79038 5.62342 9.61673 5.63246C9.44309 5.6415 9.27476 5.69547 9.12825 5.78911C7.01247 7.14098 5.17312 8.88294 3.70825 10.9221L3.24825 11.5631C3.15668 11.6906 3.10742 11.8436 3.10742 12.0006C3.10742 12.1576 3.15668 12.3106 3.24825 12.4381L3.70825 13.0781C5.17302 15.1176 7.01238 16.8599 9.12825 18.2121C9.76825 18.6221 10.6142 18.1971 10.6702 17.4391L10.7382 16.4991C10.7862 15.8401 10.8242 15.1801 10.8512 14.5191C13.0346 14.4554 15.203 14.8986 17.1862 15.8141L19.6862 16.9681C19.8276 17.0334 19.9858 17.053 20.1388 17.0244C20.2918 16.9957 20.4321 16.9201 20.5402 16.8081V16.8071ZM18.3302 14.6891L17.8152 14.4521C15.394 13.3345 12.7271 12.855 10.0682 13.0591C9.88363 13.0734 9.7108 13.1554 9.58304 13.2894C9.45528 13.4235 9.38162 13.6 9.37625 13.7851C9.35025 14.6551 9.30625 15.5231 9.24225 16.3911L9.23625 16.4781C7.57168 15.3033 6.11498 13.8588 4.92625 12.2041L4.78025 12.0001L4.92625 11.7971C6.11498 10.1425 7.57168 8.69792 9.23625 7.52311L9.24225 7.61011C9.29925 8.38511 9.34025 9.16011 9.36725 9.93611C9.37373 10.1307 9.45561 10.3151 9.59556 10.4504C9.73552 10.5856 9.92259 10.6612 10.1172 10.6611H11.2412C12.6704 10.6611 14.075 11.0323 15.3176 11.7384C16.5601 12.4445 17.5989 13.4613 18.3302 14.6891Z" fill="#EC3A4C"/>
                            </svg>
                          }
                        >
                          پاسخ
                        </Button>
                      </div>
                    </div>
                    <div className='w-full border border-gray-200 rounded-2xl flex flex-col gap-4 px-7 pt-6 pb-4'>
                      <div className='w-full flex justify-between items-center'>
                        <div className='flex flex-row gap-2 items-center'>
                          <img src={person1} className='w-14 h-14 rounded-2xl border-4 border-gray-200' alt='' />
                          <div className='flex flex-col gap-2 justify-around'>
                            <span className='text-lg text-gray-800'>مریم محمدی</span>
                            <span className='text-xs text-gray-300'>کاربر آوسبیلدونگ</span>
                          </div>
                        </div>
                        <div className='inline-flex gap-3 h-max'>
                          <Button
                            styleVariant='textonly'
                            size='small'
                            leftIcon={
                              <img src={like} alt='' />
                            }
                          >2</Button>
                          <Button
                            styleVariant='textonly'
                            size='small'
                            leftIcon={
                              <img src={like} alt='' className='rotate-180' />
                            }
                          >2</Button>
                        </div>
                      </div>
                      <p className='leading-8 text-right text-gray-500'>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای است.</p>
                      <div className='w-full flex justify-end'>
                        <Button
                          styleVariant='textonly'
                          className='text-primary-default'
                          leftIcon={
                            <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
                              <path fill-rule="evenodd" clip-rule="evenodd" d="M20.5402 16.8071C20.6486 16.695 20.7193 16.552 20.7426 16.3979C20.7659 16.2438 20.7406 16.0862 20.6702 15.9471L19.9392 14.5061C19.1252 12.8982 17.8814 11.5473 16.3459 10.6036C14.8105 9.6599 13.0435 9.16024 11.2412 9.16011H10.8372C10.8117 8.60669 10.7787 8.05364 10.7382 7.50111L10.6702 6.56211C10.6576 6.38869 10.6001 6.22152 10.5035 6.07698C10.4068 5.93245 10.2743 5.81549 10.1188 5.73757C9.96339 5.65964 9.79038 5.62342 9.61673 5.63246C9.44309 5.6415 9.27476 5.69547 9.12825 5.78911C7.01247 7.14098 5.17312 8.88294 3.70825 10.9221L3.24825 11.5631C3.15668 11.6906 3.10742 11.8436 3.10742 12.0006C3.10742 12.1576 3.15668 12.3106 3.24825 12.4381L3.70825 13.0781C5.17302 15.1176 7.01238 16.8599 9.12825 18.2121C9.76825 18.6221 10.6142 18.1971 10.6702 17.4391L10.7382 16.4991C10.7862 15.8401 10.8242 15.1801 10.8512 14.5191C13.0346 14.4554 15.203 14.8986 17.1862 15.8141L19.6862 16.9681C19.8276 17.0334 19.9858 17.053 20.1388 17.0244C20.2918 16.9957 20.4321 16.9201 20.5402 16.8081V16.8071ZM18.3302 14.6891L17.8152 14.4521C15.394 13.3345 12.7271 12.855 10.0682 13.0591C9.88363 13.0734 9.7108 13.1554 9.58304 13.2894C9.45528 13.4235 9.38162 13.6 9.37625 13.7851C9.35025 14.6551 9.30625 15.5231 9.24225 16.3911L9.23625 16.4781C7.57168 15.3033 6.11498 13.8588 4.92625 12.2041L4.78025 12.0001L4.92625 11.7971C6.11498 10.1425 7.57168 8.69792 9.23625 7.52311L9.24225 7.61011C9.29925 8.38511 9.34025 9.16011 9.36725 9.93611C9.37373 10.1307 9.45561 10.3151 9.59556 10.4504C9.73552 10.5856 9.92259 10.6612 10.1172 10.6611H11.2412C12.6704 10.6611 14.075 11.0323 15.3176 11.7384C16.5601 12.4445 17.5989 13.4613 18.3302 14.6891Z" fill="#EC3A4C"/>
                            </svg>
                          }
                        >
                          پاسخ
                        </Button>
                      </div>
                    </div>
                  </div>
                  <div className='w-full'>
                    <Button
                      styleVariant='textonly'
                      className='text-primary-default'
                      rightIcon={
                        <img src={ph_arrow} alt='' className='rotate-180' />
                      }
                    >
                      نظرات بیشتر
                    </Button>
                  </div>
                </div>
              </div>
              <div className='w-1/4 flex flex-col gap-10'>
                <div className='bg-gray-200 py-4 rounded-lg'>
                  ad
                </div>
                <div className='bg-gray-200 py-4 rounded-lg'>
                  ad
                </div>
              </div>
            </div>
            
          </MainContainer>
          <Footer/>
        </div>
      </div>
    </div>
  );
}

export default Ausbildung;