import '../App.css';
import Auth from '../components/auth/index';
import MainContainer from '../components/container';
import "slick-carousel/slick/slick.css";
import "slick-carousel/slick/slick-theme.css";
import Footer from '../components/footer';
import like from '../icons/like.svg';
import ph_arrow from '../icons/ph_arrow-up-duotone.svg';
import Button from '../components/button';
import Social from '../components/social';
import berlin from '../images/berlin.png'
import house from '../images/house.png';
import BlogCard from '../components/blog_card';
import VideoPlayer from '../components/video_player';
import { Link } from 'react-router-dom';
import person1 from '../images/person1.png'

function Blog() {
  return (
    <div className="bg-white">
      <Auth />
      <div className='w-full flex flex-col items-center text-center'>
        <div className='w-full bg-gray-50 flex-col justify-center py-14 pb-0 relative'>
          <MainContainer className='inline-flex flex-col justify-center items-center z-10 relative gap-10'>
            <div className='w-full flex flex-row gap-5'>
              <div className='w-1/2'>
                <Link to={'/single_blog'}>
                  <div className='relative w-full h-max'>
                    <img src={house} className='w-full' alt="" />
                    <div className='absolute rounded-xl p-5 flex flex-col justify-between items-start text-right top-0 left-0 right-0 bottom-0 bg-black bg-opacity-30'>
                      <span className='bg-[#EC3A4C80] text-white px-3 py-1 rounded-md font-thin text-sm'>مقالات آموزشی</span>
                      <p className='text-white text-lg p-2'>چگونه میتوان در ابتدای ورود به آلمان ، صاحب اولین خانه خود شد؟</p>
                    </div>
                  </div>
                </Link>
              </div>
              <div className='w-1/2 grid grid-cols-1 sm:grid-cols-2 gap-5'>
                <div className='relative rounded-lg overflow-hidden w-full h-max'>
                  <img src={house} alt="" />
                  <div className='absolute p-5 flex flex-col justify-between items-start text-right top-0 left-0 right-0 bottom-0 bg-black bg-opacity-30'>
                    <span className='bg-[#EC3A4C80] text-white px-3 py-1 rounded-md font-thin text-sm'>مقالات آموزشی</span>
                    <p className='text-white text-lg p-2'>چگونه میتوان در ابتدای ورود به آلمان ، صاحب اولین خانه خود شد؟</p>
                  </div>
                </div>
                <div className='relative rounded-lg overflow-hidden w-full h-max'>
                  <img src={house} alt="" />
                  <div className='absolute p-5 flex flex-col justify-between items-start text-right top-0 left-0 right-0 bottom-0 bg-black bg-opacity-30'>
                    <span className='bg-[#EC3A4C80] text-white px-3 py-1 rounded-md font-thin text-sm'>مقالات آموزشی</span>
                    <p className='text-white text-lg p-2'>چگونه میتوان در ابتدای ورود به آلمان ، صاحب اولین خانه خود شد؟</p>
                  </div>
                </div>
                <div className='relative rounded-lg overflow-hidden w-full h-max'>
                  <img src={house} alt="" />
                  <div className='absolute p-5 flex flex-col justify-between items-start text-right top-0 left-0 right-0 bottom-0 bg-black bg-opacity-30'>
                    <span className='bg-[#EC3A4C80] text-white px-3 py-1 rounded-md font-thin text-sm'>مقالات آموزشی</span>
                    <p className='text-white text-lg p-2'>چگونه میتوان در ابتدای ورود به آلمان ، صاحب اولین خانه خود شد؟</p>
                  </div>
                </div>
                <div className='relative rounded-lg overflow-hidden w-full h-max'>
                  <img src={house} alt="" />
                  <div className='absolute p-5 flex flex-col justify-between items-start text-right top-0 left-0 right-0 bottom-0 bg-black bg-opacity-30'>
                    <span className='bg-[#EC3A4C80] text-white px-3 py-1 rounded-md font-thin text-sm'>مقالات آموزشی</span>
                    <p className='text-white text-lg p-2'>چگونه میتوان در ابتدای ورود به آلمان ، صاحب اولین خانه خود شد؟</p>
                  </div>
                </div>
              </div>
            </div>
            <div className='w-full bg-gray-200 pt-5 pb-32 rounded-lg relative mb-24'>
              <h6 className='text-primary-default text-xl'>دسته بندی مقالات</h6>
              <div className='inline-flex absolute w-[93%] items-center justify-center -bottom-24 left-1/2 gap-5 -translate-x-1/2'>
                <div className='w-1/7 bg-primary-default text-white flex flex-col py-4 gap-10 px-7 rounded-lg border border-gray-200 items-center justify-center'>
                  <svg xmlns="http://www.w3.org/2000/svg" width="70" height="70" viewBox="0 0 70 70" fill="none">
                    <path d="M8.75065 52.5H61.2507V58.3333H8.75065V52.5ZM62.7352 24.8704C62.3418 23.6889 61.4952 22.712 60.3816 22.1546C59.2679 21.5972 57.9785 21.5051 56.7969 21.8983L43.7507 26.25L20.4173 17.5L14.584 20.4167L32.084 32.0833L20.4173 37.9167L8.75065 32.0833L5.83398 35L17.5007 46.6667L59.9294 30.7562C61.0678 30.3289 61.9962 29.4768 62.5194 28.3792C63.0426 27.2816 63.12 26.0239 62.7352 24.8704Z" fill="white"/>
                  </svg>
                  <div className='inline-flex gap-2'>
                    <p className='text-base'>راهنمای محاجرت</p>
                    <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
                      <path d="M10.4067 5.55986L4 11.9999L10.4067 18.4399C10.4645 18.5158 10.538 18.5785 10.6222 18.6236C10.7064 18.6687 10.7993 18.6952 10.8946 18.7013C10.9899 18.7074 11.0854 18.6929 11.1747 18.6589C11.2639 18.6248 11.3448 18.572 11.4118 18.504C11.4789 18.436 11.5305 18.3544 11.5633 18.2646C11.596 18.1749 11.6091 18.0792 11.6017 17.984C11.5943 17.8888 11.5664 17.7963 11.5201 17.7128C11.4738 17.6292 11.4101 17.5566 11.3333 17.4999L6.54 12.6665L19.2933 12.6665C19.4701 12.6665 19.6397 12.5963 19.7647 12.4713C19.8898 12.3462 19.96 12.1767 19.96 11.9999C19.96 11.8231 19.8898 11.6535 19.7647 11.5285C19.6397 11.4034 19.4701 11.3332 19.2933 11.3332L6.54 11.3332L11.3333 6.49986C11.458 6.37433 11.5277 6.20441 11.527 6.02751C11.5264 5.8506 11.4555 5.68118 11.33 5.55653C11.2045 5.43188 11.0346 5.3622 10.8576 5.36283C10.6807 5.36345 10.5113 5.43433 10.3867 5.55986L10.4067 5.55986Z" fill="#F8F8F8"/>
                    </svg>
                  </div>
                </div>
                <div className='w-1/7 bg-white flex flex-col py-4 gap-10 px-11 rounded-lg border border-gray-200 items-center justify-center'>
                  <svg xmlns="http://www.w3.org/2000/svg" width="70" height="70" viewBox="0 0 70 70" fill="none">
                    <path d="M37.7445 64.0382C44.5044 63.4088 50.8303 60.4316 55.6237 55.6237C67.0132 44.2341 67.0132 25.7658 55.6237 14.3762C44.2341 2.98659 25.7658 2.98659 14.3762 14.3762C2.98659 25.7658 2.98659 44.2341 14.3762 55.6237C17.2959 58.5498 20.8057 60.8203 24.6716 62.2838C28.5376 63.7473 32.671 64.3702 36.7966 64.1112C37.1141 64.1571 37.4378 64.1322 37.7445 64.0382ZM10.4328 31.6574C11.0565 27.0254 12.9834 22.6658 15.9891 19.0866L31.9083 34.9999L28.7349 38.1733C25.6666 35.6941 22.2483 34.3583 18.9903 33.4833C17.0945 32.9758 15.2103 32.6083 13.4866 32.2787L13.4399 32.267C12.3695 32.0628 11.3691 31.8674 10.4358 31.6574H10.4328ZM10.2316 36.0908C11.0074 36.2541 11.792 36.4058 12.5649 36.5574L12.6058 36.5633C14.3645 36.9045 16.1116 37.2428 17.8528 37.7095C20.6324 38.4562 23.2808 39.5062 25.617 41.2912L15.992 50.9162C12.4897 46.7447 10.4645 41.5325 10.2316 36.0908ZM28.7203 44.3741C30.6891 46.8883 31.7537 49.6416 32.5033 52.462C32.8678 53.8328 33.1478 55.1687 33.4308 56.522L33.6758 57.6741C33.8216 58.3741 33.982 59.077 34.157 59.777C28.6287 59.5968 23.3208 57.5663 19.0837 54.0108L28.7203 44.3741ZM38.6166 59.5291C38.366 58.6126 38.1443 57.6886 37.9516 56.7583L37.727 55.6878C37.4412 54.3199 37.1291 52.8295 36.7324 51.3362C35.8545 48.0462 34.5099 44.5199 31.8324 41.262L34.9999 38.0945L50.9162 54.0108C47.4084 56.9569 43.1494 58.8677 38.6166 59.5291ZM38.0916 34.9999L41.6266 31.4678C44.8758 34.2153 48.2766 35.7262 51.4412 36.7937C52.7449 37.237 54.0574 37.6162 55.2649 37.9691C55.7287 38.1033 56.1778 38.2316 56.6066 38.3599C57.6274 38.6691 58.5637 38.9666 59.4183 39.2962C58.6716 43.5785 56.8061 47.5873 54.0108 50.9162L38.0916 34.9999ZM57.8578 34.1687L56.3937 33.7399C55.2026 33.4025 54.0191 33.0388 52.8441 32.6491C50.0908 31.7158 47.3374 30.4908 44.7328 28.3616L54.0078 19.0837C57.7022 23.4846 59.7474 29.0354 59.7916 34.7812C59.1499 34.5624 58.4995 34.3612 57.8578 34.1687ZM50.9162 15.9891L41.6383 25.267C39.5091 22.6624 38.2812 19.9091 37.3508 17.1558C36.9597 15.9802 36.596 14.7957 36.2599 13.6033C36.1141 13.1191 35.977 12.632 35.8283 12.142C35.6358 11.5003 35.4374 10.8499 35.2187 10.2083C40.9641 10.2516 46.5149 12.2957 50.9162 15.9891ZM33.2033 18.5558C34.2737 21.7203 35.7816 25.1241 38.532 28.3733L34.9999 31.9083L19.0837 15.9891C22.4126 13.1937 26.4214 11.3282 30.7037 10.5816C31.0333 11.4362 31.3308 12.3695 31.637 13.3933L32.0308 14.7349C32.3808 15.9424 32.7599 17.252 33.2033 18.5558Z" fill="#EC3A4C"/>
                  </svg>
                  <p className='text-base text-gray-800'>مقالات ورزشی</p>
                </div>
                <div className='w-1/7 bg-white flex flex-col py-4 gap-10 px-11 rounded-lg border border-gray-200 items-center justify-center'>
                  <svg xmlns="http://www.w3.org/2000/svg" width="70" height="70" viewBox="0 0 70 70" fill="none">
                    <path d="M40.65 56.3613C52.45 65.2613 62.65 69.2613 66.2 65.7113C71.2 60.7113 61.2 42.7113 44 25.7113C26.8 8.71133 8.99996 -1.48866 3.99996 3.51134C0.749964 6.71134 3.99996 15.4113 11.05 25.8613" stroke="#EC3A4C" stroke-width="4" stroke-linecap="round" stroke-linejoin="round"/>
                    <path d="M24.6 9.26168C28.4098 7.51885 32.5965 6.7614 36.7754 7.05892C40.9544 7.35644 44.9915 8.6994 48.516 10.9644C52.0404 13.2294 54.9391 16.3438 56.9458 20.0215C58.9525 23.6992 60.0027 27.8222 60 32.0117C60.0014 35.3587 59.3386 38.6727 58.05 41.7617M50 52.0117C45.1857 55.6224 39.2305 57.3754 33.2278 56.9488C27.2251 56.5222 21.5776 53.9446 17.3224 49.6894C13.0671 45.4341 10.4895 39.7866 10.0629 33.7839C9.63633 27.7812 11.3893 21.826 15 17.0117" stroke="#EC3A4C" stroke-width="4" stroke-linecap="round" stroke-linejoin="round"/>
                  </svg>
                  <p className='text-base text-gray-800'>مقالات علمی</p>
                </div>
                <div className='w-1/7 bg-white flex flex-col py-4 gap-10 px-11 rounded-lg border border-gray-200 items-center justify-center'>
                  <svg xmlns="http://www.w3.org/2000/svg" width="70" height="70" viewBox="0 0 70 70" fill="none">
                    <path d="M52.5 41.5625C54.2405 41.5625 55.9097 40.8711 57.1404 39.6404C58.3711 38.4097 59.0625 36.7405 59.0625 35C59.0625 33.2595 58.3711 31.5903 57.1404 30.3596C55.9097 29.1289 54.2405 28.4375 52.5 28.4375C50.7595 28.4375 49.0903 29.1289 47.8596 30.3596C46.6289 31.5903 45.9375 33.2595 45.9375 35C45.9375 36.7405 46.6289 38.4097 47.8596 39.6404C49.0903 40.8711 50.7595 41.5625 52.5 41.5625ZM52.5 39.375C51.3397 39.375 50.2269 38.9141 49.4064 38.0936C48.5859 37.2731 48.125 36.1603 48.125 35C48.125 33.8397 48.5859 32.7269 49.4064 31.9064C50.2269 31.0859 51.3397 30.625 52.5 30.625C53.6603 30.625 54.7731 31.0859 55.5936 31.9064C56.4141 32.7269 56.875 33.8397 56.875 35C56.875 36.1603 56.4141 37.2731 55.5936 38.0936C54.7731 38.9141 53.6603 39.375 52.5 39.375ZM36.0938 19.1406C36.0938 20.446 35.5752 21.6979 34.6522 22.6209C33.7291 23.5439 32.4772 24.0625 31.1719 24.0625C29.8665 24.0625 28.6146 23.5439 27.6916 22.6209C26.7686 21.6979 26.25 20.446 26.25 19.1406C26.25 17.8353 26.7686 16.5834 27.6916 15.6603C28.6146 14.7373 29.8665 14.2188 31.1719 14.2188C32.4772 14.2188 33.7291 14.7373 34.6522 15.6603C35.5752 16.5834 36.0938 17.8353 36.0938 19.1406ZM22.9688 27.8906C22.9688 28.537 22.8414 29.177 22.5941 29.7741C22.3467 30.3713 21.9842 30.9139 21.5272 31.3709C21.0701 31.828 20.5275 32.1905 19.9304 32.4378C19.3332 32.6852 18.6932 32.8125 18.0469 32.8125C17.4005 32.8125 16.7605 32.6852 16.1634 32.4378C15.5662 32.1905 15.0236 31.828 14.5666 31.3709C14.1095 30.9139 13.747 30.3713 13.4997 29.7741C13.2523 29.177 13.125 28.537 13.125 27.8906C13.125 26.5853 13.6436 25.3334 14.5666 24.4103C15.4896 23.4873 16.7415 22.9688 18.0469 22.9688C19.3522 22.9688 20.6041 23.4873 21.5272 24.4103C22.4502 25.3334 22.9688 26.5853 22.9688 27.8906ZM18.0469 48.125C18.6932 48.125 19.3332 47.9977 19.9304 47.7503C20.5275 47.503 21.0701 47.1405 21.5272 46.6834C21.9842 46.2264 22.3467 45.6838 22.5941 45.0866C22.8414 44.4895 22.9688 43.8495 22.9688 43.2031C22.9688 42.5568 22.8414 41.9168 22.5941 41.3196C22.3467 40.7225 21.9842 40.1799 21.5272 39.7228C21.0701 39.2658 20.5275 38.9033 19.9304 38.6559C19.3332 38.4086 18.6932 38.2812 18.0469 38.2812C16.7415 38.2812 15.4896 38.7998 14.5666 39.7228C13.6436 40.6459 13.125 41.8978 13.125 43.2031C13.125 44.5085 13.6436 45.7604 14.5666 46.6834C15.4896 47.6064 16.7415 48.125 18.0469 48.125ZM35 53.0469C35 54.3522 34.4814 55.6041 33.5584 56.5272C32.6354 57.4502 31.3835 57.9688 30.0781 57.9688C28.7728 57.9688 27.5209 57.4502 26.5978 56.5272C25.6748 55.6041 25.1562 54.3522 25.1562 53.0469C25.1562 51.7415 25.6748 50.4896 26.5978 49.5666C27.5209 48.6436 28.7728 48.125 30.0781 48.125C31.3835 48.125 32.6354 48.6436 33.5584 49.5666C34.4814 50.4896 35 51.7415 35 53.0469Z" fill="#EC3A4C"/>
                    <path d="M35.4373 67.8124C29.3306 67.3664 23.4336 65.3943 18.2873 62.0767C10.7659 57.6705 5.29979 50.4602 3.08855 42.0283C2.1355 38.3573 1.92455 34.533 2.46807 30.7794C3.0116 27.0259 4.29865 23.4185 6.25387 20.1686C14.4723 6.60613 32.8954 2.59644 49.1026 10.8586C58.7692 15.7914 65.9989 24.4014 67.517 32.7992C68.0215 35.1164 67.9647 37.5206 67.3513 39.8114C66.7379 42.1021 65.5857 44.213 63.9907 45.968C59.2701 51.1217 53.1779 51.0496 48.7504 50.9992H48.7351C45.7929 50.9467 43.9554 50.9993 43.5157 51.8743C43.6689 52.548 43.9357 53.1955 44.3032 53.7839C45.408 55.3376 45.9629 57.2155 45.8801 59.1201C45.7973 61.0247 45.0815 62.8473 43.8461 64.2992C42.8088 65.4918 41.5105 66.4291 40.0522 67.0384C38.5938 67.6477 37.0146 67.9125 35.4373 67.8124ZM31.782 10.9374C27.4648 10.7907 23.184 11.7729 19.3626 13.787C15.5412 15.8011 12.3114 18.7774 9.9923 22.4217C8.33756 25.1786 7.24958 28.2379 6.79207 31.4206C6.33457 34.6032 6.51674 37.8451 7.32793 40.9564C9.25144 48.2609 13.9957 54.5032 20.5186 58.3121C27.8489 62.6608 37.2179 65.5308 40.4489 61.5342C42.1704 59.4167 41.6236 58.1108 40.4226 55.7986C39.8032 54.9611 39.404 53.9813 39.2618 52.9494C39.1197 51.9174 39.239 50.8662 39.6089 49.8924C41.3173 46.5236 45.117 46.5608 48.7964 46.6111C52.8104 46.6658 57.3648 46.7205 60.7664 43.0039C61.8903 41.7358 62.6983 40.2197 63.1241 38.5796C63.5499 36.9394 63.5815 35.2218 63.2164 33.5671C61.952 26.5671 55.4814 19.0136 47.1207 14.7546C42.3809 12.2946 37.1264 10.9903 31.7864 10.9483L31.782 10.9374Z" fill="#EC3A4C"/>
                  </svg>
                  <p className='text-base text-gray-800'>مقالات هنری</p>
                </div>
                <div className='w-1/7 bg-white flex flex-col py-4 gap-10 px-11 rounded-lg border border-gray-200 items-center justify-center'>
                  <svg xmlns="http://www.w3.org/2000/svg" width="70" height="70" viewBox="0 0 70 70" fill="none">
                    <path d="M7.875 49.2188C5.6875 44.8438 4.375 40.0312 4.375 35C4.375 18.1562 18.1562 4.375 35 4.375V8.75C20.5625 8.75 8.75 20.5625 8.75 35C8.75 39.375 9.84375 43.3125 11.8125 47.0312L7.875 49.2188ZM61.25 35C61.25 49.4375 49.4375 61.25 35 61.25C28.6562 61.25 22.75 59.0625 18.1562 55.125L30.625 42.6562L27.5625 39.375L13.3438 53.5938C12.4688 54.4688 12.4688 55.7812 13.3438 56.6562C19.0312 62.3438 26.9062 65.625 35 65.625C51.8438 65.625 65.625 51.8438 65.625 35H61.25Z" fill="#EC3A4C"/>
                    <path d="M39.3742 54.6875C39.1554 54.6875 38.7179 54.6875 38.4992 54.4688C37.8429 54.25 37.1867 53.5938 37.1867 52.7188L35.6554 41.7812L40.0304 41.125L40.9054 48.3438L45.7179 44.625V32.8125C45.7179 32.1562 45.9367 31.7188 46.3742 31.2812L53.3742 24.2813C55.3429 22.3125 56.6554 19.4688 56.6554 16.625V13.125H53.3742C50.5304 13.125 47.6867 14.2188 45.7179 16.4062L38.7179 23.4062C38.2804 23.8438 37.8429 24.0625 37.1867 24.0625H25.1554L21.4367 28.875L28.6554 29.75L27.9992 34.125L17.0617 32.5938C16.1867 32.5938 15.5304 31.9375 15.3117 31.2812C15.0929 30.625 15.0929 29.75 15.5304 29.0938L22.0929 20.3438C22.7492 19.9062 23.4054 19.6875 24.0617 19.6875H36.3117L42.8742 13.125C45.7179 10.2813 49.6554 8.75 53.5929 8.75H56.8742C59.2804 8.75 61.2492 10.7188 61.2492 13.125V16.4062C61.2492 20.5625 59.7179 24.2812 56.8742 27.125L50.3117 33.6875V45.9375C50.3117 46.5938 50.0929 47.25 49.4367 47.6875L40.6867 54.25C40.2492 54.4688 39.8117 54.6875 39.3742 54.6875Z" fill="#EC3A4C"/>
                  </svg>
                  <p className='text-base text-gray-800'>مقالات ورزشی</p>
                </div>
                <div className='w-1/7 bg-white flex flex-col py-4 gap-10 px-6 rounded-lg border border-gray-200 items-center justify-center'>
                  <svg xmlns="http://www.w3.org/2000/svg" width="70" height="70" viewBox="0 0 70 70" fill="none">
                    <path d="M14.5833 35H8.75L35 8.75L61.25 35H55.4167M14.5833 35V55.4167C14.5833 56.9638 15.1979 58.4475 16.2919 59.5415C17.3858 60.6354 18.8696 61.25 20.4167 61.25H49.5833C51.1304 61.25 52.6142 60.6354 53.7081 59.5415C54.8021 58.4475 55.4167 56.9638 55.4167 55.4167V35" stroke="#EC3A4C" stroke-width="4" stroke-linecap="round" stroke-linejoin="round"/>
                    <path d="M29.166 35H40.8327V46.6667H29.166V35Z" stroke="#EC3A4C" stroke-width="4" stroke-linecap="round" stroke-linejoin="round"/>
                  </svg>
                  <p className='text-base text-gray-800'>یافتن خانه در آلمان</p>
                </div>
                <div className='w-1/7 bg-white flex flex-col py-4 gap-10 px-7 rounded-lg border border-gray-200 items-center justify-center'>
                  <svg xmlns="http://www.w3.org/2000/svg" width="70" height="70" viewBox="0 0 70 70" fill="none">
                    <path fill-rule="evenodd" clip-rule="evenodd" d="M35 58.3333C47.8873 58.3333 58.3333 47.8873 58.3333 35C58.3333 22.1127 47.8873 11.6667 35 11.6667C22.1127 11.6667 11.6667 22.1127 11.6667 35C11.6667 47.8873 22.1127 58.3333 35 58.3333ZM35 61.25C49.4973 61.25 61.25 49.4973 61.25 35C61.25 20.5027 49.4973 8.75 35 8.75C20.5027 8.75 8.75 20.5027 8.75 35C8.75 49.4973 20.5027 61.25 35 61.25Z" fill="#EC3A4C"/>
                    <path fill-rule="evenodd" clip-rule="evenodd" d="M24.3472 40.8332C26.6149 46.4215 30.793 49.5832 35.0003 49.5832C39.209 49.5832 43.3857 46.4215 45.6534 40.8332H24.3472ZM35.0003 52.4998C29.1115 52.4998 24.0074 48.0548 21.499 41.5623C21.4745 41.4997 21.4502 41.437 21.4261 41.3742C20.7757 39.6373 22.167 37.9165 24.0234 37.9165H45.9786C47.8351 37.9165 49.2278 39.6373 48.5744 41.3742C48.5509 41.437 48.5271 41.4997 48.503 41.5623C45.9932 48.0548 40.889 52.4998 35.0003 52.4998Z" fill="#EC3A4C"/>
                    <path d="M31.0647 32.728C31.2543 32.2059 31.1974 31.5686 31.0414 30.9882C30.8535 30.3197 30.5526 29.6884 30.1518 29.1215C29.3045 27.9125 27.9001 26.8028 26.0028 26.7211C24.0384 26.6394 22.5714 27.8863 21.6672 29.209C21.2329 29.8457 20.8916 30.541 20.6536 31.274C20.4451 31.9244 20.3343 32.5894 20.4072 33.1217C20.4239 33.2431 20.471 33.3583 20.544 33.4566C20.6171 33.555 20.7137 33.6334 20.825 33.6845C20.9364 33.7357 21.0588 33.758 21.181 33.7493C21.3032 33.7407 21.4213 33.7014 21.5243 33.635C22.1076 33.2617 22.7186 32.7498 23.2845 32.2773C23.5411 32.0615 23.7905 31.8544 24.0209 31.6721C24.8405 31.0246 25.4793 30.6557 26.0072 30.6294C26.5103 30.6046 27.0907 30.8919 27.8228 31.4403C28.0853 31.6357 28.3391 31.8428 28.6016 32.0586L28.8859 32.2905C29.2418 32.5778 29.6209 32.8723 30.003 33.1028C30.0952 33.1583 30.1985 33.1928 30.3056 33.2037C30.4127 33.2147 30.5208 33.2017 30.6223 33.1659C30.7238 33.1301 30.8161 33.0722 30.8926 32.9965C30.9691 32.9208 31.0278 32.8291 31.0647 32.728ZM38.8099 32.728C38.6203 32.2059 38.6786 31.5686 38.8347 30.9882C38.998 30.3815 39.2999 29.7296 39.7243 29.1215C40.5701 27.9125 41.9759 26.8028 43.8732 26.7211C45.8361 26.6394 47.3047 27.8863 48.2089 29.209C48.6668 29.8798 49.008 30.6061 49.2224 31.274C49.4295 31.9244 49.5403 32.5894 49.4674 33.1217C49.4505 33.2429 49.4035 33.3578 49.3305 33.456C49.2576 33.5542 49.1611 33.6324 49.05 33.6835C48.9389 33.7347 48.8167 33.757 48.6947 33.7485C48.5727 33.7401 48.4548 33.701 48.3518 33.635C47.7684 33.2617 47.1559 32.7498 46.5916 32.2773C46.3487 32.0724 46.1032 31.8706 45.8551 31.6721C45.0341 31.0246 44.3968 30.6557 43.8674 30.6294C43.3643 30.6046 42.7839 30.8919 42.0532 31.4403C41.7907 31.6357 41.537 31.8428 41.2745 32.0586L40.9886 32.2905C40.6353 32.5858 40.2626 32.8571 39.873 33.1028C39.7808 33.1586 39.6774 33.1933 39.5701 33.2044C39.4629 33.2154 39.3545 33.2026 39.2528 33.1668C39.1512 33.1309 39.0587 33.073 38.9821 32.9971C38.9055 32.9212 38.8467 32.8293 38.8099 32.728Z" fill="#EC3A4C"/>
                  </svg>
                  <p className='text-base text-gray-800'>زندگی بهتر در آلمان</p>
                </div>
              </div>
            </div>
            <div className='w-full flex flex-col gap-8'>
              <div className='border-r-8 border-primary-default text-right pr-4 text-2xl'>
                آخرین اخبار 
              </div>
              <div className='w-full inline-flex justify-between gap-16'>
                <BlogCard />
                <BlogCard />
                <BlogCard />
                <BlogCard />
              </div>
            </div>
            

            <Social/>
            <div className='w-full inline-flex items-start gap-7 my-10'>
              <div className='inline-flex flex-col w-3/4 h-full gap-7'>
                <div className='inline-flex flex-col items-center gap-4 shadow-md p-7 bg-white rounded-lg h-max'>
                  <div className='w-full inline-flex flex-row gap-2 items-center justify-start p-2 pb-8'>
                    <svg xmlns="http://www.w3.org/2000/svg" width="30" height="30" viewBox="0 0 30 30" fill="none">
                      <path d="M8.75 8.75H21.25V11.25H8.75V8.75ZM8.75 13.75H17.5V16.25H8.75V13.75Z" fill="black"/>
                      <path d="M25 2.5H5C3.62125 2.5 2.5 3.62125 2.5 5V27.5L9.16625 22.5H25C26.3787 22.5 27.5 21.3787 27.5 20V5C27.5 3.62125 26.3787 2.5 25 2.5ZM25 20H8.33375L5 22.5V5H25V20Z" fill="black"/>
                    </svg>
                    <span className='text-2xl'>دیدگاه خود را بنویسید</span>
                  </div>
                  <div className='w-full inline-flex gap-4'>
                    <input className='bg-gray-100 text-gray-600 placeholder:text-gray-300 p-5 rounded-lg outline-none w-1/3' placeholder='نام خود را وارد کنید' />
                    <input className='bg-gray-100 text-gray-600 placeholder:text-gray-300 p-5 rounded-lg outline-none w-1/3' placeholder='ایمیل خود را وارد کنید' />
                  </div>
                  <div className='w-full h-max'>
                    <textarea className='bg-gray-100 text-gray-600 placeholder:text-gray-300 p-5 rounded-lg outline-none w-full h-48' placeholder='دیدگاه خود را بنویسید' />
                  </div>
                  <div className='w-full inline-flex justify-end'>
                    <Button>ارسال نظر</Button>
                  </div>
                  <div className='w-full flex flex-col gap-4 py-8'>
                    <div className='w-full border border-gray-200 rounded-2xl flex flex-col gap-4 px-7 pt-6 pb-4'>
                      <div className='w-full flex justify-between items-center'>
                        <div className='flex flex-row gap-2 items-center'>
                          <img src={person1} className='w-14 h-14 rounded-2xl border-4 border-gray-200' alt='' />
                          <div className='flex flex-col gap-3 justify-around'>
                            <span className='text-lg text-gray-800'>مریم محمدی</span>
                            <span className='text-xs text-gray-300'>کاربر آوسبیلدونگ</span>
                          </div>
                        </div>
                        <div className='inline-flex gap-3 h-max'>
                          <Button
                            styleVariant='textonly'
                            size='small'
                            leftIcon={
                              <img src={like} alt='' />
                            }
                          >2</Button>
                          <Button
                            styleVariant='textonly'
                            size='small'
                            leftIcon={
                              <img src={like} alt='' className='rotate-180' />
                            }
                          >2</Button>
                        </div>
                      </div>
                      <p className='leading-8 text-right text-gray-500'>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای است.</p>
                      <div className='w-full flex justify-end'>
                        <Button
                          styleVariant='textonly'
                          className='text-primary-default'
                          leftIcon={
                            <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
                              <path fill-rule="evenodd" clip-rule="evenodd" d="M20.5402 16.8071C20.6486 16.695 20.7193 16.552 20.7426 16.3979C20.7659 16.2438 20.7406 16.0862 20.6702 15.9471L19.9392 14.5061C19.1252 12.8982 17.8814 11.5473 16.3459 10.6036C14.8105 9.6599 13.0435 9.16024 11.2412 9.16011H10.8372C10.8117 8.60669 10.7787 8.05364 10.7382 7.50111L10.6702 6.56211C10.6576 6.38869 10.6001 6.22152 10.5035 6.07698C10.4068 5.93245 10.2743 5.81549 10.1188 5.73757C9.96339 5.65964 9.79038 5.62342 9.61673 5.63246C9.44309 5.6415 9.27476 5.69547 9.12825 5.78911C7.01247 7.14098 5.17312 8.88294 3.70825 10.9221L3.24825 11.5631C3.15668 11.6906 3.10742 11.8436 3.10742 12.0006C3.10742 12.1576 3.15668 12.3106 3.24825 12.4381L3.70825 13.0781C5.17302 15.1176 7.01238 16.8599 9.12825 18.2121C9.76825 18.6221 10.6142 18.1971 10.6702 17.4391L10.7382 16.4991C10.7862 15.8401 10.8242 15.1801 10.8512 14.5191C13.0346 14.4554 15.203 14.8986 17.1862 15.8141L19.6862 16.9681C19.8276 17.0334 19.9858 17.053 20.1388 17.0244C20.2918 16.9957 20.4321 16.9201 20.5402 16.8081V16.8071ZM18.3302 14.6891L17.8152 14.4521C15.394 13.3345 12.7271 12.855 10.0682 13.0591C9.88363 13.0734 9.7108 13.1554 9.58304 13.2894C9.45528 13.4235 9.38162 13.6 9.37625 13.7851C9.35025 14.6551 9.30625 15.5231 9.24225 16.3911L9.23625 16.4781C7.57168 15.3033 6.11498 13.8588 4.92625 12.2041L4.78025 12.0001L4.92625 11.7971C6.11498 10.1425 7.57168 8.69792 9.23625 7.52311L9.24225 7.61011C9.29925 8.38511 9.34025 9.16011 9.36725 9.93611C9.37373 10.1307 9.45561 10.3151 9.59556 10.4504C9.73552 10.5856 9.92259 10.6612 10.1172 10.6611H11.2412C12.6704 10.6611 14.075 11.0323 15.3176 11.7384C16.5601 12.4445 17.5989 13.4613 18.3302 14.6891Z" fill="#EC3A4C"/>
                            </svg>
                          }
                        >
                          پاسخ
                        </Button>
                      </div>
                    </div>
                    <div className='w-full border border-gray-200 rounded-2xl flex flex-col gap-4 px-7 pt-6 pb-4'>
                      <div className='w-full flex justify-between items-center'>
                        <div className='flex flex-row gap-2 items-center'>
                          <img src={person1} className='w-14 h-14 rounded-2xl border-4 border-gray-200' alt='' />
                          <div className='flex flex-col gap-2 justify-around'>
                            <span className='text-lg text-gray-800'>مریم محمدی</span>
                            <span className='text-xs text-gray-300'>کاربر آوسبیلدونگ</span>
                          </div>
                        </div>
                        <div className='inline-flex gap-3 h-max'>
                          <Button
                            styleVariant='textonly'
                            size='small'
                            leftIcon={
                              <img src={like} alt='' />
                            }
                          >2</Button>
                          <Button
                            styleVariant='textonly'
                            size='small'
                            leftIcon={
                              <img src={like} alt='' className='rotate-180' />
                            }
                          >2</Button>
                        </div>
                      </div>
                      <p className='leading-8 text-right text-gray-500'>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای است.</p>
                      <div className='w-full flex justify-end'>
                        <Button
                          styleVariant='textonly'
                          className='text-primary-default'
                          leftIcon={
                            <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
                              <path fill-rule="evenodd" clip-rule="evenodd" d="M20.5402 16.8071C20.6486 16.695 20.7193 16.552 20.7426 16.3979C20.7659 16.2438 20.7406 16.0862 20.6702 15.9471L19.9392 14.5061C19.1252 12.8982 17.8814 11.5473 16.3459 10.6036C14.8105 9.6599 13.0435 9.16024 11.2412 9.16011H10.8372C10.8117 8.60669 10.7787 8.05364 10.7382 7.50111L10.6702 6.56211C10.6576 6.38869 10.6001 6.22152 10.5035 6.07698C10.4068 5.93245 10.2743 5.81549 10.1188 5.73757C9.96339 5.65964 9.79038 5.62342 9.61673 5.63246C9.44309 5.6415 9.27476 5.69547 9.12825 5.78911C7.01247 7.14098 5.17312 8.88294 3.70825 10.9221L3.24825 11.5631C3.15668 11.6906 3.10742 11.8436 3.10742 12.0006C3.10742 12.1576 3.15668 12.3106 3.24825 12.4381L3.70825 13.0781C5.17302 15.1176 7.01238 16.8599 9.12825 18.2121C9.76825 18.6221 10.6142 18.1971 10.6702 17.4391L10.7382 16.4991C10.7862 15.8401 10.8242 15.1801 10.8512 14.5191C13.0346 14.4554 15.203 14.8986 17.1862 15.8141L19.6862 16.9681C19.8276 17.0334 19.9858 17.053 20.1388 17.0244C20.2918 16.9957 20.4321 16.9201 20.5402 16.8081V16.8071ZM18.3302 14.6891L17.8152 14.4521C15.394 13.3345 12.7271 12.855 10.0682 13.0591C9.88363 13.0734 9.7108 13.1554 9.58304 13.2894C9.45528 13.4235 9.38162 13.6 9.37625 13.7851C9.35025 14.6551 9.30625 15.5231 9.24225 16.3911L9.23625 16.4781C7.57168 15.3033 6.11498 13.8588 4.92625 12.2041L4.78025 12.0001L4.92625 11.7971C6.11498 10.1425 7.57168 8.69792 9.23625 7.52311L9.24225 7.61011C9.29925 8.38511 9.34025 9.16011 9.36725 9.93611C9.37373 10.1307 9.45561 10.3151 9.59556 10.4504C9.73552 10.5856 9.92259 10.6612 10.1172 10.6611H11.2412C12.6704 10.6611 14.075 11.0323 15.3176 11.7384C16.5601 12.4445 17.5989 13.4613 18.3302 14.6891Z" fill="#EC3A4C"/>
                            </svg>
                          }
                        >
                          پاسخ
                        </Button>
                      </div>
                    </div>
                  </div>
                  <div className='w-full'>
                    <Button
                      styleVariant='textonly'
                      className='text-primary-default'
                      rightIcon={
                        <img src={ph_arrow} alt='' className='rotate-180' />
                      }
                    >
                      نظرات بیشتر
                    </Button>
                  </div>
                </div>
              </div>
              <div className='w-1/4 flex flex-col gap-10'>
                <div className='bg-gray-200 py-4 rounded-lg'>
                  ad
                </div>
                <div className='bg-gray-200 py-4 rounded-lg'>
                  ad
                </div>
              </div>
            </div>
            
          </MainContainer>
          <div className='w-full bg-gray-900 text-white py-16 mt-10'>
            <MainContainer>
              <div className='w-full flex flex-col gap-12'>
                <div className='border-r-8 border-primary-default text-right pr-4 text-2xl'>
                  ویدیو های پیشنهادی هر دسته  
                </div>
                <div className='w-full inline-flex justify-between gap-10'>
                  <VideoPlayer />
                  <VideoPlayer />
                </div>
              </div>
            </MainContainer>
          </div>
          
          <div className='py-14'>
            <MainContainer className={'flex flex-col gap-8'}>
              <div className='w-full flex flex-col gap-8'>
                <div className='border-r-8 border-primary-default text-right pr-4 text-2xl mb-10'>
                  آخرین اخبار 
                </div>
                <div className='w-full inline-flex justify-between gap-16'>
                  <div className='w-3/4 flex flex-col gap-8'>
                    <BlogCard horizontal={true} />
                    <BlogCard horizontal={true} />
                    <BlogCard horizontal={true} />
                    <BlogCard horizontal={true} />
                  </div>
                  <div className='w-1/4 flex flex-col gap-10'>
                    <div className='bg-gray-100 py-44'>aaa</div>
                    <div className='bg-gray-100 py-44'>aaa</div>
                  </div>
                </div>
              </div>
              <div className='flex flex-col gap-6'>
                <div className='border-r-8 border-primary-default text-right pr-4 text-2xl'>
                  آخرین اخبار 
                </div>
                <div className='w-full justify-between inline-flex gap-16'>
                  <div className='w-full flex flex-col gap-2 items-start'>
                    <img src={berlin} alt='' className='w-full mb-3' />
                    <h5 className='font-bold'>برلین ( Berlin)</h5>
                    <div className='inline-flex gap-2'>
                      <p className='text-gray-700'>مشاهده اطلاعات</p>
                      <svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 20 20" fill="none">
                        <path d="M8.67287 4.63338L3.33398 10L8.67287 15.3667C8.72109 15.43 8.78235 15.4823 8.8525 15.5198C8.92266 15.5574 9.00007 15.5795 9.07949 15.5846C9.15892 15.5896 9.2385 15.5776 9.31287 15.5492C9.38723 15.5208 9.45463 15.4768 9.5105 15.4202C9.56637 15.3635 9.60942 15.2955 9.63672 15.2207C9.66402 15.1459 9.67493 15.0662 9.66873 14.9868C9.66253 14.9075 9.63935 14.8304 9.60077 14.7608C9.56219 14.6912 9.5091 14.6307 9.4451 14.5834L5.45065 10.5556L16.0784 10.5556C16.2258 10.5556 16.3671 10.4971 16.4713 10.3929C16.5755 10.2887 16.634 10.1474 16.634 10C16.634 9.85271 16.5755 9.7114 16.4713 9.60721C16.3671 9.50302 16.2258 9.44449 16.0784 9.44449L5.45065 9.44449L9.4451 5.41672C9.54897 5.3121 9.60704 5.17051 9.60652 5.02308C9.60599 4.87566 9.54693 4.73448 9.44232 4.6306C9.3377 4.52673 9.19611 4.46866 9.04869 4.46918C8.90126 4.4697 8.76008 4.52877 8.65621 4.63338L8.67287 4.63338Z" fill="#EC3A4C"/>
                      </svg>
                    </div>
                  </div>
                  <div className='w-full flex flex-col gap-2 items-start'>
                    <img src={berlin} alt='' className='w-full mb-3' />
                    <h5 className='font-bold'>برلین ( Berlin)</h5>
                    <div className='inline-flex gap-2'>
                      <p className='text-gray-700'>مشاهده اطلاعات</p>
                      <svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 20 20" fill="none">
                        <path d="M8.67287 4.63338L3.33398 10L8.67287 15.3667C8.72109 15.43 8.78235 15.4823 8.8525 15.5198C8.92266 15.5574 9.00007 15.5795 9.07949 15.5846C9.15892 15.5896 9.2385 15.5776 9.31287 15.5492C9.38723 15.5208 9.45463 15.4768 9.5105 15.4202C9.56637 15.3635 9.60942 15.2955 9.63672 15.2207C9.66402 15.1459 9.67493 15.0662 9.66873 14.9868C9.66253 14.9075 9.63935 14.8304 9.60077 14.7608C9.56219 14.6912 9.5091 14.6307 9.4451 14.5834L5.45065 10.5556L16.0784 10.5556C16.2258 10.5556 16.3671 10.4971 16.4713 10.3929C16.5755 10.2887 16.634 10.1474 16.634 10C16.634 9.85271 16.5755 9.7114 16.4713 9.60721C16.3671 9.50302 16.2258 9.44449 16.0784 9.44449L5.45065 9.44449L9.4451 5.41672C9.54897 5.3121 9.60704 5.17051 9.60652 5.02308C9.60599 4.87566 9.54693 4.73448 9.44232 4.6306C9.3377 4.52673 9.19611 4.46866 9.04869 4.46918C8.90126 4.4697 8.76008 4.52877 8.65621 4.63338L8.67287 4.63338Z" fill="#EC3A4C"/>
                      </svg>
                    </div>
                  </div>
                  <div className='w-full flex flex-col gap-2 items-start'>
                    <img src={berlin} alt='' className='w-full mb-3' />
                    <h5 className='font-bold'>برلین ( Berlin)</h5>
                    <div className='inline-flex gap-2'>
                      <p className='text-gray-700'>مشاهده اطلاعات</p>
                      <svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 20 20" fill="none">
                        <path d="M8.67287 4.63338L3.33398 10L8.67287 15.3667C8.72109 15.43 8.78235 15.4823 8.8525 15.5198C8.92266 15.5574 9.00007 15.5795 9.07949 15.5846C9.15892 15.5896 9.2385 15.5776 9.31287 15.5492C9.38723 15.5208 9.45463 15.4768 9.5105 15.4202C9.56637 15.3635 9.60942 15.2955 9.63672 15.2207C9.66402 15.1459 9.67493 15.0662 9.66873 14.9868C9.66253 14.9075 9.63935 14.8304 9.60077 14.7608C9.56219 14.6912 9.5091 14.6307 9.4451 14.5834L5.45065 10.5556L16.0784 10.5556C16.2258 10.5556 16.3671 10.4971 16.4713 10.3929C16.5755 10.2887 16.634 10.1474 16.634 10C16.634 9.85271 16.5755 9.7114 16.4713 9.60721C16.3671 9.50302 16.2258 9.44449 16.0784 9.44449L5.45065 9.44449L9.4451 5.41672C9.54897 5.3121 9.60704 5.17051 9.60652 5.02308C9.60599 4.87566 9.54693 4.73448 9.44232 4.6306C9.3377 4.52673 9.19611 4.46866 9.04869 4.46918C8.90126 4.4697 8.76008 4.52877 8.65621 4.63338L8.67287 4.63338Z" fill="#EC3A4C"/>
                      </svg>
                    </div>
                  </div>
                  <div className='w-full flex flex-col gap-2 items-start'>
                    <img src={berlin} alt='' className='w-full mb-3' />
                    <h5 className='font-bold'>برلین ( Berlin)</h5>
                    <div className='inline-flex gap-2'>
                      <p className='text-gray-700'>مشاهده اطلاعات</p>
                      <svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 20 20" fill="none">
                        <path d="M8.67287 4.63338L3.33398 10L8.67287 15.3667C8.72109 15.43 8.78235 15.4823 8.8525 15.5198C8.92266 15.5574 9.00007 15.5795 9.07949 15.5846C9.15892 15.5896 9.2385 15.5776 9.31287 15.5492C9.38723 15.5208 9.45463 15.4768 9.5105 15.4202C9.56637 15.3635 9.60942 15.2955 9.63672 15.2207C9.66402 15.1459 9.67493 15.0662 9.66873 14.9868C9.66253 14.9075 9.63935 14.8304 9.60077 14.7608C9.56219 14.6912 9.5091 14.6307 9.4451 14.5834L5.45065 10.5556L16.0784 10.5556C16.2258 10.5556 16.3671 10.4971 16.4713 10.3929C16.5755 10.2887 16.634 10.1474 16.634 10C16.634 9.85271 16.5755 9.7114 16.4713 9.60721C16.3671 9.50302 16.2258 9.44449 16.0784 9.44449L5.45065 9.44449L9.4451 5.41672C9.54897 5.3121 9.60704 5.17051 9.60652 5.02308C9.60599 4.87566 9.54693 4.73448 9.44232 4.6306C9.3377 4.52673 9.19611 4.46866 9.04869 4.46918C8.90126 4.4697 8.76008 4.52877 8.65621 4.63338L8.67287 4.63338Z" fill="#EC3A4C"/>
                      </svg>
                    </div>
                  </div>
                </div>
                
              </div>
              <div className='w-full mt-8'><Social/></div>
              
            </MainContainer>
          </div>
          <Footer/>
        </div>
      </div>
    </div>
  );
}

export default Blog;