import '../App.css';
import Auth from '../components/auth/index';
import MainContainer from '../components/container';
import single_course from '../images/singlecourse.png'
import "slick-carousel/slick/slick.css";
import "slick-carousel/slick/slick-theme.css";
import Footer from '../components/footer';
import germany from '../icons/emojione_flag-for-germany.svg'
import like from '../icons/like.svg'
import ph_arrow from '../icons/ph_arrow-up-duotone.svg'
import Button from '../components/button';
import Social from '../components/social';
import person1 from '../images/person1.png'
import house from '../images/house.png'

function SingleBlog() {
  return (
    <div className="bg-gray-50">
      <Auth />
      <div className='w-full flex flex-col items-center text-center'>
        <div className='w-full bg-gray-50 flex-col justify-center py-6 pb-0 relative'>
          <MainContainer className='inline-flex flex-col justify-center items-center z-10 relative'>
            <div className='w-full flex justify-between'>
              <div className='inline-flex flex-row rounded-md overflow-hidden text-right gap-3'>
                <p>بلاگ ها  -  مطالب آموزشی  -  </p>
                <span className='text-gray-400'>راهنمای ثبت نام در سایت آوسبیلدونگ</span>
              </div>
            </div>
            <div className='w-full inline-flex items-start gap-7 my-10'>
              <div className='inline-flex flex-col w-3/4 h-full gap-7'>
                <div className='inline-flex flex-col items-center shadow-md bg-white rounded-xl h-max'>
                  <div className='w-full justify-start gap-4 items-center inline-flex flex-row py-8 px-5 pl-3 border-b'>
                    <span className='bg-primary-default rounded-full w-6 h-6'></span>
                    <h1 className='text-2xl'>چگونه میتوان در ابتدای ورود به آلمان ، صاحب اولین خانه خود شد؟</h1>
                  </div>
                  <div className='w-full inline-flex gap-2 justify-end text-gray-400 py-4 px-7'><span>تاریخ انتشار: </span><span>۱۶۰۲/۱۱/۲۳</span></div>
                  
                  <div className='w-full inline-flex justify-center items-center flex-col gap-4 text-right px-10 py-10'>

                    <div className='py-4'><img src={house} alt='' className='w-[45vw]'/></div>

                    <p className="text-gray-700 leading-9">لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.</p>
                    
                    <div className='py-4'><img src={house} alt='' className='w-[45vw]'/></div>

                    <p className="text-gray-700 leading-9">لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای است.</p>

                    <p className="text-gray-700 leading-9">لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای است.</p>
                    
                    <p className="text-gray-700 leading-9">لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.</p>

                  </div>
                  <div className='w-full flex justify-between border-t p-4 border-gray-100'>
                    <div className='inline-flex items-center gap-3'>
                      <span className='text-gray-600 text-lg rounded-3xl'>برچسب ها:</span>
                      <span className='bg-gray-100 text-gray-500 rounded-3xl px-5 py-2 text-sm'>فلان چیز</span>
                      <span className='bg-gray-100 text-gray-500 rounded-3xl px-5 py-2 text-sm'>فلان چیز</span>
                      <span className='bg-gray-100 text-gray-500 rounded-3xl px-5 py-2 text-sm'>فلان چیز</span>
                    </div>
                    <div className='inline-flex items-center gap-4'>
                      <div className='flex items-center gap-1'>
                        <span className='text-gray-800'>اشتراک گذاری:</span>
                        <svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 20 20" fill="none">
                          <path d="M10.7449 14.5593C10.862 14.6765 10.9278 14.8354 10.9278 15.0011C10.9278 15.1668 10.862 15.3257 10.7449 15.4429L9.96833 16.2241C9.1471 17.0449 8.03346 17.5057 6.87242 17.5054C5.71138 17.505 4.59804 17.0434 3.77732 16.2222C2.9566 15.401 2.49573 14.2873 2.49609 13.1263C2.49646 11.9652 2.95803 10.8519 3.77927 10.0312L5.66365 8.1468C6.45246 7.35735 7.51315 6.8992 8.62866 6.86609C9.74418 6.83297 10.8302 7.22741 11.6644 7.96868C11.726 8.02326 11.7762 8.08943 11.8122 8.16341C11.8482 8.23739 11.8692 8.31774 11.8742 8.39986C11.8791 8.48198 11.8678 8.56427 11.8409 8.64203C11.8141 8.71979 11.7721 8.7915 11.7176 8.85305C11.663 8.91461 11.5968 8.96481 11.5228 9.0008C11.4488 9.03678 11.3685 9.05784 11.2864 9.06278C11.2042 9.06771 11.122 9.05642 11.0442 9.02955C10.9664 9.00268 10.8947 8.96076 10.8332 8.90618C10.2373 8.37704 9.46185 8.09552 8.66532 8.11919C7.86879 8.14286 7.1114 8.46994 6.54802 9.03352L4.66365 10.9156C4.07748 11.5017 3.74817 12.2967 3.74817 13.1257C3.74817 13.9547 4.07748 14.7497 4.66365 15.3359C5.24982 15.922 6.04483 16.2513 6.8738 16.2513C7.70277 16.2513 8.49779 15.922 9.08396 15.3359L9.86052 14.5593C9.91857 14.5012 9.9875 14.4551 10.0634 14.4236C10.1392 14.3922 10.2206 14.376 10.3027 14.376C10.3848 14.376 10.4662 14.3922 10.542 14.4236C10.6179 14.4551 10.6869 14.5012 10.7449 14.5593ZM16.2199 3.77805C15.3985 2.95854 14.2856 2.49829 13.1254 2.49829C11.9651 2.49829 10.8522 2.95854 10.0308 3.77805L9.25427 4.5554C9.1371 4.67267 9.07131 4.83169 9.07139 4.99747C9.07146 5.16325 9.13739 5.32221 9.25466 5.43938C9.37194 5.55655 9.53096 5.62234 9.69674 5.62226C9.86251 5.62219 10.0215 5.55627 10.1386 5.43899L10.9152 4.66243C11.5014 4.07626 12.2964 3.74695 13.1254 3.74695C13.9543 3.74695 14.7494 4.07626 15.3355 4.66243C15.9217 5.2486 16.251 6.04362 16.251 6.87258C16.251 7.70155 15.9217 8.49657 15.3355 9.08274L13.4511 10.9687C12.8875 11.5319 12.1299 11.8586 11.3334 11.8818C10.5369 11.9051 9.76154 11.6231 9.16599 11.0937C9.04167 10.9834 8.87865 10.9271 8.7128 10.9371C8.54695 10.947 8.39185 11.0225 8.28162 11.1468C8.17138 11.2711 8.11506 11.4341 8.12502 11.6C8.13498 11.7658 8.21042 11.9209 8.33474 12.0312C9.1688 12.7727 10.2547 13.1674 11.3702 13.1345C12.4857 13.1017 13.5465 12.6438 14.3355 11.8546L16.2199 9.97024C17.0399 9.14882 17.5004 8.03559 17.5004 6.87493C17.5004 5.71427 17.0399 4.60104 16.2199 3.77962V3.77805Z" fill="#333333"/>
                        </svg>
                      </div>
                      <span className='h-full w-1 border-r border-gray-200'></span>
                      <div className='flex items-center gap-5 px-3'>
                        <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
                          <path d="M15.2995 5.55011C14.5395 5.54999 13.8098 5.84824 13.2674 6.38068C12.7251 6.91313 12.4134 7.63721 12.3995 8.39711L12.3715 9.97211C12.3699 10.0567 12.3504 10.1399 12.3143 10.2164C12.2782 10.2929 12.2264 10.3609 12.1622 10.416C12.098 10.471 12.0228 10.5119 11.9417 10.5359C11.8606 10.5599 11.7754 10.5664 11.6915 10.5551L10.1305 10.3431C8.07653 10.0631 6.10853 9.11711 4.22053 7.54411C3.62253 10.8541 4.79053 13.1471 7.60353 14.9161L9.35053 16.0141C9.43354 16.0663 9.5025 16.138 9.55138 16.223C9.60026 16.308 9.62757 16.4036 9.63093 16.5016C9.63428 16.5996 9.61358 16.6969 9.57062 16.785C9.52767 16.8731 9.46378 16.9494 9.38453 17.0071L7.79253 18.1701C8.73953 18.2291 9.63853 18.1871 10.3845 18.0391C15.1025 17.0971 18.2395 13.5471 18.2395 7.69111C18.2395 7.21311 17.2275 5.55011 15.2995 5.55011ZM10.3995 8.36011C10.417 7.39616 10.7184 6.45878 11.2661 5.66534C11.8138 4.87189 12.5833 4.25763 13.4784 3.89948C14.3736 3.54133 15.3544 3.45519 16.2983 3.65186C17.2421 3.84853 18.107 4.31926 18.7845 5.00511C19.4955 5.00011 20.1005 5.18011 21.4535 4.36011C21.1185 6.00011 20.9535 6.71211 20.2395 7.69111C20.2395 15.3331 15.5425 19.0491 10.7765 20.0001C7.50853 20.6521 2.75653 19.5811 1.39453 18.1591C2.08853 18.1051 4.90853 17.8021 6.53853 16.6091C5.15953 15.7001 -0.329469 12.4701 3.27753 3.78611C4.97053 5.76311 6.68753 7.10911 8.42753 7.82311C9.58553 8.29811 9.86953 8.28811 10.4005 8.36111L10.3995 8.36011Z" fill="#8A8A8A"/>
                        </svg>
                        <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
                          <path d="M19.0508 4.91006C18.134 3.98399 17.042 3.24973 15.8384 2.75011C14.6349 2.25049 13.3439 1.99552 12.0408 2.00006C6.58078 2.00006 2.13078 6.45006 2.13078 11.9101C2.13078 13.6601 2.59078 15.3601 3.45078 16.8601L2.05078 22.0001L7.30078 20.6201C8.75078 21.4101 10.3808 21.8301 12.0408 21.8301C17.5008 21.8301 21.9508 17.3801 21.9508 11.9201C21.9508 9.27006 20.9208 6.78006 19.0508 4.91006ZM12.0408 20.1501C10.5608 20.1501 9.11078 19.7501 7.84078 19.0001L7.54078 18.8201L4.42078 19.6401L5.25078 16.6001L5.05078 16.2901C4.22853 14.977 3.79192 13.4593 3.79078 11.9101C3.79078 7.37006 7.49078 3.67006 12.0308 3.67006C14.2308 3.67006 16.3008 4.53006 17.8508 6.09006C18.6183 6.85402 19.2265 7.76272 19.6402 8.76348C20.0539 9.76425 20.2648 10.8372 20.2608 11.9201C20.2808 16.4601 16.5808 20.1501 12.0408 20.1501ZM16.5608 13.9901C16.3108 13.8701 15.0908 13.2701 14.8708 13.1801C14.6408 13.1001 14.4808 13.0601 14.3108 13.3001C14.1408 13.5501 13.6708 14.1101 13.5308 14.2701C13.3908 14.4401 13.2408 14.4601 12.9908 14.3301C12.7408 14.2101 11.9408 13.9401 11.0008 13.1001C10.2608 12.4401 9.77078 11.6301 9.62078 11.3801C9.48078 11.1301 9.60078 11.0001 9.73078 10.8701C9.84078 10.7601 9.98078 10.5801 10.1008 10.4401C10.2208 10.3001 10.2708 10.1901 10.3508 10.0301C10.4308 9.86006 10.3908 9.72006 10.3308 9.60006C10.2708 9.48006 9.77078 8.26006 9.57078 7.76006C9.37078 7.28006 9.16078 7.34006 9.01078 7.33006H8.53078C8.36078 7.33006 8.10078 7.39006 7.87078 7.64006C7.65078 7.89006 7.01078 8.49006 7.01078 9.71006C7.01078 10.9301 7.90078 12.1101 8.02078 12.2701C8.14078 12.4401 9.77078 14.9401 12.2508 16.0101C12.8408 16.2701 13.3008 16.4201 13.6608 16.5301C14.2508 16.7201 14.7908 16.6901 15.2208 16.6301C15.7008 16.5601 16.6908 16.0301 16.8908 15.4501C17.1008 14.8701 17.1008 14.3801 17.0308 14.2701C16.9608 14.1601 16.8108 14.1101 16.5608 13.9901Z" fill="#8A8A8A"/>
                        </svg> 
                        <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
                          <path d="M12 7.5C11.11 7.5 10.24 7.76392 9.49993 8.25839C8.75991 8.75285 8.18314 9.45566 7.84254 10.2779C7.50195 11.1002 7.41283 12.005 7.58647 12.8779C7.7601 13.7508 8.18868 14.5526 8.81802 15.182C9.44736 15.8113 10.2492 16.2399 11.1221 16.4135C11.995 16.5872 12.8998 16.4981 13.7221 16.1575C14.5443 15.8169 15.2471 15.2401 15.7416 14.5001C16.2361 13.76 16.5 12.89 16.5 12C16.5 10.8065 16.0259 9.66193 15.182 8.81802C14.3381 7.97411 13.1935 7.5 12 7.5ZM12 15C11.4067 15 10.8266 14.8241 10.3333 14.4944C9.83994 14.1648 9.45542 13.6962 9.22836 13.1481C9.0013 12.5999 8.94189 11.9967 9.05764 11.4147C9.1734 10.8328 9.45912 10.2982 9.87868 9.87868C10.2982 9.45912 10.8328 9.1734 11.4147 9.05764C11.9967 8.94189 12.5999 9.0013 13.1481 9.22836C13.6962 9.45542 14.1648 9.83994 14.4944 10.3333C14.8241 10.8266 15 11.4067 15 12C14.9975 12.7949 14.6807 13.5565 14.1186 14.1186C13.5565 14.6807 12.7949 14.9975 12 15ZM16.125 2.625H7.875C6.48261 2.625 5.14726 3.17812 4.16269 4.16269C3.17812 5.14726 2.625 6.48261 2.625 7.875V16.125C2.625 17.5174 3.17812 18.8527 4.16269 19.8373C5.14726 20.8219 6.48261 21.375 7.875 21.375H16.125C17.5174 21.375 18.8527 20.8219 19.8373 19.8373C20.8219 18.8527 21.375 17.5174 21.375 16.125V7.875C21.375 6.48261 20.8219 5.14726 19.8373 4.16269C18.8527 3.17812 17.5174 2.625 16.125 2.625ZM19.875 16.125C19.875 16.6175 19.778 17.1051 19.5895 17.5601C19.4011 18.015 19.1249 18.4284 18.7766 18.7766C18.4284 19.1249 18.015 19.4011 17.5601 19.5895C17.1051 19.778 16.6175 19.875 16.125 19.875H7.875C7.38254 19.875 6.89491 19.778 6.43994 19.5895C5.98497 19.4011 5.57157 19.1249 5.22335 18.7766C4.87513 18.4284 4.59891 18.015 4.41045 17.5601C4.222 17.1051 4.125 16.6175 4.125 16.125V7.875C4.125 6.88044 4.52009 5.92661 5.22335 5.22335C5.92661 4.52009 6.88044 4.125 7.875 4.125H16.125C16.6175 4.125 17.1051 4.222 17.5601 4.41045C18.015 4.59891 18.4284 4.87513 18.7766 5.22335C19.1249 5.57157 19.4011 5.98497 19.5895 6.43994C19.778 6.89491 19.875 7.38254 19.875 7.875V16.125ZM18 7.125C18 7.3475 17.934 7.56501 17.8104 7.75002C17.6868 7.93502 17.5111 8.07922 17.3055 8.16436C17.1 8.24951 16.8738 8.27179 16.6555 8.22838C16.4373 8.18498 16.2368 8.07783 16.0795 7.9205C15.9222 7.76316 15.815 7.56271 15.7716 7.34448C15.7282 7.12625 15.7505 6.90005 15.8356 6.69448C15.9208 6.48891 16.065 6.31321 16.25 6.1896C16.435 6.06598 16.6525 6 16.875 6C17.1734 6 17.4595 6.11853 17.6705 6.3295C17.8815 6.54048 18 6.82663 18 7.125Z" fill="#8A8A8A"/>
                        </svg>
                      </div>
                    </div>
                  </div>
                </div>
              </div>
              <div className='w-1/4 flex flex-col gap-10'>
                <div className='w-full flex flex-col h-full bg-white shadow-lg border-gray-100 rounded-xl shadow-s'>
                  <div className='inline-flex items-center gap-2 border-b bg-primary-default text-white rounded-t-xl border-gray-100 px-4 py-4'>
                    <svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 20 20" fill="none">
                      <rect width="20" height="20" transform="translate(0 20) rotate(-90)" fill="#EC3A4C"/>
                      <path d="M15.8332 17.5002L15.8332 2.50017C15.8327 2.34831 15.7908 2.19944 15.712 2.06961C15.6332 1.93977 15.5205 1.83389 15.386 1.76334C15.2516 1.6928 15.1004 1.66027 14.9488 1.66925C14.7972 1.67824 14.6509 1.7284 14.5257 1.81434L3.69234 9.31434C3.24318 9.62517 3.24318 10.3735 3.69234 10.6852L14.5257 18.1852C14.6506 18.272 14.797 18.3229 14.9488 18.3324C15.1007 18.3418 15.2522 18.3095 15.387 18.2389C15.5218 18.1683 15.6346 18.0621 15.7133 17.9319C15.792 17.8016 15.8334 17.6523 15.8332 17.5002Z" fill="#F6F6F6"/>
                    </svg>
                    <span className='text-xl'>آوسبیلدونگ های مشابه</span>
                  </div>
                  <div className='inline-flex border-b border-gray-100 justify-between gap-2 p-4 items-center'>
                    <div className='inline-flex gap-4'>
                      <img src={single_course} alt='' className='w-16 h-16 rounded-lg' />
                      <div className='inline-flex flex-col items-start justify-around gap-1'>
                        <p className='text-gray-900 text-lg'>پیرا پزشکی</p>
                        <p className='text-primary-default text-base'>Gesundheitswesen</p>
                      </div>
                    </div>
                    <span className='bg-gray-100 p-1 rounded-lg'>
                      <svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 20 20" fill="none">
                        <path d="M9.08084 4.04372C9.16862 4.13161 9.21792 4.25075 9.21792 4.37497C9.21792 4.49919 9.16862 4.61833 9.08084 4.70622L4.25662 9.53122L16.8746 9.53122C16.9989 9.53122 17.1181 9.58061 17.206 9.66852C17.294 9.75642 17.3433 9.87565 17.3433 9.99997C17.3433 10.1243 17.294 10.2435 17.206 10.3314C17.1181 10.4193 16.9989 10.4687 16.8746 10.4687L4.25662 10.4687L9.08084 15.2937C9.16364 15.3826 9.20871 15.5001 9.20657 15.6216C9.20443 15.743 9.15523 15.8589 9.06935 15.9447C8.98347 16.0306 8.8676 16.0798 8.74616 16.082C8.62473 16.0841 8.5072 16.039 8.41834 15.9562L2.79334 10.3312C2.70556 10.2433 2.65625 10.1242 2.65625 9.99997C2.65625 9.87575 2.70556 9.75661 2.79334 9.66872L8.41834 4.04372C8.50623 3.95594 8.62537 3.90664 8.74959 3.90664C8.87381 3.90664 8.99295 3.95594 9.08084 4.04372Z" fill="black"/>
                      </svg>
                    </span>
                  </div>
                  <div className='inline-flex border-b border-gray-100 justify-between gap-2 p-4 items-center'>
                    <div className='inline-flex gap-4'>
                      <img src={single_course} alt='' className='w-16 h-16 rounded-lg' />
                      <div className='inline-flex flex-col items-start justify-around gap-1'>
                        <p className='text-gray-900 text-lg'>پیرا پزشکی</p>
                        <p className='text-primary-default text-base'>Gesundheitswesen</p>
                      </div>
                    </div>
                    <span className='bg-gray-100 p-1 rounded-lg'>
                      <svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 20 20" fill="none">
                        <path d="M9.08084 4.04372C9.16862 4.13161 9.21792 4.25075 9.21792 4.37497C9.21792 4.49919 9.16862 4.61833 9.08084 4.70622L4.25662 9.53122L16.8746 9.53122C16.9989 9.53122 17.1181 9.58061 17.206 9.66852C17.294 9.75642 17.3433 9.87565 17.3433 9.99997C17.3433 10.1243 17.294 10.2435 17.206 10.3314C17.1181 10.4193 16.9989 10.4687 16.8746 10.4687L4.25662 10.4687L9.08084 15.2937C9.16364 15.3826 9.20871 15.5001 9.20657 15.6216C9.20443 15.743 9.15523 15.8589 9.06935 15.9447C8.98347 16.0306 8.8676 16.0798 8.74616 16.082C8.62473 16.0841 8.5072 16.039 8.41834 15.9562L2.79334 10.3312C2.70556 10.2433 2.65625 10.1242 2.65625 9.99997C2.65625 9.87575 2.70556 9.75661 2.79334 9.66872L8.41834 4.04372C8.50623 3.95594 8.62537 3.90664 8.74959 3.90664C8.87381 3.90664 8.99295 3.95594 9.08084 4.04372Z" fill="black"/>
                      </svg>
                    </span>
                  </div>
                  <div className='inline-flex border-b border-gray-100 justify-between gap-2 p-4 items-center'>
                    <div className='inline-flex gap-4'>
                      <img src={single_course} alt='' className='w-16 h-16 rounded-lg' />
                      <div className='inline-flex flex-col items-start justify-around gap-1'>
                        <p className='text-gray-900 text-lg'>پیرا پزشکی</p>
                        <p className='text-primary-default text-base'>Gesundheitswesen</p>
                      </div>
                    </div>
                    <span className='bg-gray-100 p-1 rounded-lg'>
                      <svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 20 20" fill="none">
                        <path d="M9.08084 4.04372C9.16862 4.13161 9.21792 4.25075 9.21792 4.37497C9.21792 4.49919 9.16862 4.61833 9.08084 4.70622L4.25662 9.53122L16.8746 9.53122C16.9989 9.53122 17.1181 9.58061 17.206 9.66852C17.294 9.75642 17.3433 9.87565 17.3433 9.99997C17.3433 10.1243 17.294 10.2435 17.206 10.3314C17.1181 10.4193 16.9989 10.4687 16.8746 10.4687L4.25662 10.4687L9.08084 15.2937C9.16364 15.3826 9.20871 15.5001 9.20657 15.6216C9.20443 15.743 9.15523 15.8589 9.06935 15.9447C8.98347 16.0306 8.8676 16.0798 8.74616 16.082C8.62473 16.0841 8.5072 16.039 8.41834 15.9562L2.79334 10.3312C2.70556 10.2433 2.65625 10.1242 2.65625 9.99997C2.65625 9.87575 2.70556 9.75661 2.79334 9.66872L8.41834 4.04372C8.50623 3.95594 8.62537 3.90664 8.74959 3.90664C8.87381 3.90664 8.99295 3.95594 9.08084 4.04372Z" fill="black"/>
                      </svg>
                    </span>
                  </div>
                  <div className='inline-flex border-b border-gray-100 justify-between gap-2 p-4 items-center'>
                    <div className='inline-flex gap-4'>
                      <img src={single_course} alt='' className='w-16 h-16 rounded-lg' />
                      <div className='inline-flex flex-col items-start justify-around gap-1'>
                        <p className='text-gray-900 text-lg'>پیرا پزشکی</p>
                        <p className='text-primary-default text-base'>Gesundheitswesen</p>
                      </div>
                    </div>
                    <span className='bg-gray-100 p-1 rounded-lg'>
                      <svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 20 20" fill="none">
                        <path d="M9.08084 4.04372C9.16862 4.13161 9.21792 4.25075 9.21792 4.37497C9.21792 4.49919 9.16862 4.61833 9.08084 4.70622L4.25662 9.53122L16.8746 9.53122C16.9989 9.53122 17.1181 9.58061 17.206 9.66852C17.294 9.75642 17.3433 9.87565 17.3433 9.99997C17.3433 10.1243 17.294 10.2435 17.206 10.3314C17.1181 10.4193 16.9989 10.4687 16.8746 10.4687L4.25662 10.4687L9.08084 15.2937C9.16364 15.3826 9.20871 15.5001 9.20657 15.6216C9.20443 15.743 9.15523 15.8589 9.06935 15.9447C8.98347 16.0306 8.8676 16.0798 8.74616 16.082C8.62473 16.0841 8.5072 16.039 8.41834 15.9562L2.79334 10.3312C2.70556 10.2433 2.65625 10.1242 2.65625 9.99997C2.65625 9.87575 2.70556 9.75661 2.79334 9.66872L8.41834 4.04372C8.50623 3.95594 8.62537 3.90664 8.74959 3.90664C8.87381 3.90664 8.99295 3.95594 9.08084 4.04372Z" fill="black"/>
                      </svg>
                    </span>
                  </div>
                </div>
                <div className='w-full flex flex-col h-full bg-white pt-6 shadow-lg border-gray-100 rounded-xl shadow-s relative mt-6'>
                  <img src={germany} alt='' className='w-28 absolute left-1/2 -translate-x-1/2 -top-14' />
                  <div className='inline-flex justify-center gap-2 px-6 py-10 items-center font-bold text-xl pb-14'>
                    وقتشه به محاجرت آسان فکر کنی
                  </div>
                  <span className='absolute right-12 top-24'>
                    <svg xmlns="http://www.w3.org/2000/svg" width="23" height="50" viewBox="0 0 23 50" fill="none">
                      <path d="M0.512053 47.8909C0.451787 48.1604 0.621393 48.4277 0.890878 48.4879L5.2824 49.47C5.55189 49.5303 5.81921 49.3607 5.87947 49.0912C5.93974 48.8217 5.77013 48.5544 5.50065 48.4941L1.59707 47.6212L2.47004 43.7176C2.53031 43.4481 2.3607 43.1808 2.09122 43.1205C1.82173 43.0603 1.55441 43.2299 1.49415 43.4994L0.512053 47.8909ZM9.14199 42.242L0.73213 47.5778L1.26787 48.4222L9.67773 43.0863L9.14199 42.242ZM14.6303 1.33665C25.9039 13.7165 23.2802 33.2716 9.14199 42.242L9.67773 43.0863C24.3405 33.7832 27.0616 13.5025 15.3697 0.663351L14.6303 1.33665Z" fill="black"/>
                    </svg>
                  </span>
                  <div className='inline-flex flex-col gap-6 mb-12 px-4 items-center'>
                    <Button styleVariant='secondary' className='bg-transparent text-gray-700'>درخواست مشاوره</Button>
                    <Button styleVariant='secondary' className='bg-transparent text-gray-700'>نگارش  رزومه و انگیزه نامه</Button>
                    <Button styleVariant='secondary' className='bg-transparent text-gray-700'>شرایط پذیرش پرونده و مهاجرت</Button>
                  </div>
                </div>
              </div>
            </div>
            <Social/>
            <div className='w-full inline-flex items-start gap-7 my-10'>
              <div className='inline-flex flex-col w-3/4 h-full gap-7'>
                <div className='inline-flex flex-col items-center gap-4 shadow-md p-7 bg-white rounded-lg h-max'>
                  <div className='w-full inline-flex flex-row gap-2 items-center justify-start p-2 pb-8'>
                    <svg xmlns="http://www.w3.org/2000/svg" width="30" height="30" viewBox="0 0 30 30" fill="none">
                      <path d="M8.75 8.75H21.25V11.25H8.75V8.75ZM8.75 13.75H17.5V16.25H8.75V13.75Z" fill="black"/>
                      <path d="M25 2.5H5C3.62125 2.5 2.5 3.62125 2.5 5V27.5L9.16625 22.5H25C26.3787 22.5 27.5 21.3787 27.5 20V5C27.5 3.62125 26.3787 2.5 25 2.5ZM25 20H8.33375L5 22.5V5H25V20Z" fill="black"/>
                    </svg>
                    <span className='text-2xl'>دیدگاه خود را بنویسید</span>
                  </div>
                  <div className='w-full inline-flex gap-4'>
                    <input className='bg-gray-100 text-gray-600 placeholder:text-gray-300 p-5 rounded-lg outline-none w-1/3' placeholder='نام خود را وارد کنید' />
                    <input className='bg-gray-100 text-gray-600 placeholder:text-gray-300 p-5 rounded-lg outline-none w-1/3' placeholder='ایمیل خود را وارد کنید' />
                  </div>
                  <div className='w-full h-max'>
                    <textarea className='bg-gray-100 text-gray-600 placeholder:text-gray-300 p-5 rounded-lg outline-none w-full h-48' placeholder='دیدگاه خود را بنویسید' />
                  </div>
                  <div className='w-full inline-flex justify-end'>
                    <Button>ارسال نظر</Button>
                  </div>
                  <div className='w-full flex flex-col gap-4 py-8'>
                    <div className='w-full border border-gray-200 rounded-2xl flex flex-col gap-4 px-7 pt-6 pb-4'>
                      <div className='w-full flex justify-between items-center'>
                        <div className='flex flex-row gap-2 items-center'>
                          <img src={person1} className='w-14 h-14 rounded-2xl border-4 border-gray-200' alt='' />
                          <div className='flex flex-col gap-3 justify-around'>
                            <span className='text-lg text-gray-800'>مریم محمدی</span>
                            <span className='text-xs text-gray-300'>کاربر آوسبیلدونگ</span>
                          </div>
                        </div>
                        <div className='inline-flex gap-3 h-max'>
                          <Button
                            styleVariant='textonly'
                            size='small'
                            leftIcon={
                              <img src={like} alt='' />
                            }
                          >2</Button>
                          <Button
                            styleVariant='textonly'
                            size='small'
                            leftIcon={
                              <img src={like} alt='' className='rotate-180' />
                            }
                          >2</Button>
                        </div>
                      </div>
                      <p className='leading-8 text-right text-gray-500'>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای است.</p>
                      <div className='w-full flex justify-end'>
                        <Button
                          styleVariant='textonly'
                          className='text-primary-default'
                          leftIcon={
                            <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
                              <path fill-rule="evenodd" clip-rule="evenodd" d="M20.5402 16.8071C20.6486 16.695 20.7193 16.552 20.7426 16.3979C20.7659 16.2438 20.7406 16.0862 20.6702 15.9471L19.9392 14.5061C19.1252 12.8982 17.8814 11.5473 16.3459 10.6036C14.8105 9.6599 13.0435 9.16024 11.2412 9.16011H10.8372C10.8117 8.60669 10.7787 8.05364 10.7382 7.50111L10.6702 6.56211C10.6576 6.38869 10.6001 6.22152 10.5035 6.07698C10.4068 5.93245 10.2743 5.81549 10.1188 5.73757C9.96339 5.65964 9.79038 5.62342 9.61673 5.63246C9.44309 5.6415 9.27476 5.69547 9.12825 5.78911C7.01247 7.14098 5.17312 8.88294 3.70825 10.9221L3.24825 11.5631C3.15668 11.6906 3.10742 11.8436 3.10742 12.0006C3.10742 12.1576 3.15668 12.3106 3.24825 12.4381L3.70825 13.0781C5.17302 15.1176 7.01238 16.8599 9.12825 18.2121C9.76825 18.6221 10.6142 18.1971 10.6702 17.4391L10.7382 16.4991C10.7862 15.8401 10.8242 15.1801 10.8512 14.5191C13.0346 14.4554 15.203 14.8986 17.1862 15.8141L19.6862 16.9681C19.8276 17.0334 19.9858 17.053 20.1388 17.0244C20.2918 16.9957 20.4321 16.9201 20.5402 16.8081V16.8071ZM18.3302 14.6891L17.8152 14.4521C15.394 13.3345 12.7271 12.855 10.0682 13.0591C9.88363 13.0734 9.7108 13.1554 9.58304 13.2894C9.45528 13.4235 9.38162 13.6 9.37625 13.7851C9.35025 14.6551 9.30625 15.5231 9.24225 16.3911L9.23625 16.4781C7.57168 15.3033 6.11498 13.8588 4.92625 12.2041L4.78025 12.0001L4.92625 11.7971C6.11498 10.1425 7.57168 8.69792 9.23625 7.52311L9.24225 7.61011C9.29925 8.38511 9.34025 9.16011 9.36725 9.93611C9.37373 10.1307 9.45561 10.3151 9.59556 10.4504C9.73552 10.5856 9.92259 10.6612 10.1172 10.6611H11.2412C12.6704 10.6611 14.075 11.0323 15.3176 11.7384C16.5601 12.4445 17.5989 13.4613 18.3302 14.6891Z" fill="#EC3A4C"/>
                            </svg>
                          }
                        >
                          پاسخ
                        </Button>
                      </div>
                    </div>
                    <div className='w-full border border-gray-200 rounded-2xl flex flex-col gap-4 px-7 pt-6 pb-4'>
                      <div className='w-full flex justify-between items-center'>
                        <div className='flex flex-row gap-2 items-center'>
                          <img src={person1} className='w-14 h-14 rounded-2xl border-4 border-gray-200' alt='' />
                          <div className='flex flex-col gap-2 justify-around'>
                            <span className='text-lg text-gray-800'>مریم محمدی</span>
                            <span className='text-xs text-gray-300'>کاربر آوسبیلدونگ</span>
                          </div>
                        </div>
                        <div className='inline-flex gap-3 h-max'>
                          <Button
                            styleVariant='textonly'
                            size='small'
                            leftIcon={
                              <img src={like} alt='' />
                            }
                          >2</Button>
                          <Button
                            styleVariant='textonly'
                            size='small'
                            leftIcon={
                              <img src={like} alt='' className='rotate-180' />
                            }
                          >2</Button>
                        </div>
                      </div>
                      <p className='leading-8 text-right text-gray-500'>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای است.</p>
                      <div className='w-full flex justify-end'>
                        <Button
                          styleVariant='textonly'
                          className='text-primary-default'
                          leftIcon={
                            <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
                              <path fill-rule="evenodd" clip-rule="evenodd" d="M20.5402 16.8071C20.6486 16.695 20.7193 16.552 20.7426 16.3979C20.7659 16.2438 20.7406 16.0862 20.6702 15.9471L19.9392 14.5061C19.1252 12.8982 17.8814 11.5473 16.3459 10.6036C14.8105 9.6599 13.0435 9.16024 11.2412 9.16011H10.8372C10.8117 8.60669 10.7787 8.05364 10.7382 7.50111L10.6702 6.56211C10.6576 6.38869 10.6001 6.22152 10.5035 6.07698C10.4068 5.93245 10.2743 5.81549 10.1188 5.73757C9.96339 5.65964 9.79038 5.62342 9.61673 5.63246C9.44309 5.6415 9.27476 5.69547 9.12825 5.78911C7.01247 7.14098 5.17312 8.88294 3.70825 10.9221L3.24825 11.5631C3.15668 11.6906 3.10742 11.8436 3.10742 12.0006C3.10742 12.1576 3.15668 12.3106 3.24825 12.4381L3.70825 13.0781C5.17302 15.1176 7.01238 16.8599 9.12825 18.2121C9.76825 18.6221 10.6142 18.1971 10.6702 17.4391L10.7382 16.4991C10.7862 15.8401 10.8242 15.1801 10.8512 14.5191C13.0346 14.4554 15.203 14.8986 17.1862 15.8141L19.6862 16.9681C19.8276 17.0334 19.9858 17.053 20.1388 17.0244C20.2918 16.9957 20.4321 16.9201 20.5402 16.8081V16.8071ZM18.3302 14.6891L17.8152 14.4521C15.394 13.3345 12.7271 12.855 10.0682 13.0591C9.88363 13.0734 9.7108 13.1554 9.58304 13.2894C9.45528 13.4235 9.38162 13.6 9.37625 13.7851C9.35025 14.6551 9.30625 15.5231 9.24225 16.3911L9.23625 16.4781C7.57168 15.3033 6.11498 13.8588 4.92625 12.2041L4.78025 12.0001L4.92625 11.7971C6.11498 10.1425 7.57168 8.69792 9.23625 7.52311L9.24225 7.61011C9.29925 8.38511 9.34025 9.16011 9.36725 9.93611C9.37373 10.1307 9.45561 10.3151 9.59556 10.4504C9.73552 10.5856 9.92259 10.6612 10.1172 10.6611H11.2412C12.6704 10.6611 14.075 11.0323 15.3176 11.7384C16.5601 12.4445 17.5989 13.4613 18.3302 14.6891Z" fill="#EC3A4C"/>
                            </svg>
                          }
                        >
                          پاسخ
                        </Button>
                      </div>
                    </div>
                  </div>
                  <div className='w-full'>
                    <Button
                      styleVariant='textonly'
                      className='text-primary-default'
                      rightIcon={
                        <img src={ph_arrow} alt='' className='rotate-180' />
                      }
                    >
                      نظرات بیشتر
                    </Button>
                  </div>
                </div>
              </div>
              <div className='w-1/4 flex flex-col gap-10'>
                <div className='bg-gray-200 py-48 rounded-lg'>
                  ad
                </div>
                <div className='bg-gray-200 py-48 rounded-lg'>
                  ad
                </div>
              </div>
            </div>
            
          </MainContainer>
          <Footer/>
        </div>
      </div>
    </div>
  );
}

export default SingleBlog;